#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/imagebuilder/imagebuilder-staging/runs/run-5zowYMKFL3aSPQva

Waiting for the plan to start...

Terraform v0.14.0
Configuring remote state backend...
Initializing Terraform configuration...
aws_cloudwatch_log_group.pozorbot_cloudwatch_logs: Refreshing state... [id=/aws/lambda/pozorbot_staging]
aws_sqs_queue.image_builder_pozorbot: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/933752197999/image-builder-pozorbot-staging]
aws_iam_user.packer: Refreshing state... [id=packer_staging]
aws_s3_bucket.imagebuilder_s3: Refreshing state... [id=imagebuilder.service.staging]
aws_cloudwatch_log_group.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_policy.vmimport_ec2: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_ec2_staging]
aws_iam_user.imagebuilder_worker: Refreshing state... [id=imagebuilder_worker_staging]
aws_cloudwatch_log_group.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_role.external_worker: Refreshing state... [id=external_worker_staging]
aws_iam_role.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_role.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_iam_role.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_cloudwatch_log_stream.internal_composer_syslog: Refreshing state... [id=internal_composer_syslog]
aws_iam_role.vmimport: Refreshing state... [id=vmimport_staging]
aws_iam_role.pozorbot_lambda_role: Refreshing state... [id=pozorbot_lambda_role_staging]
aws_iam_role.spot_fleet_tagging_role: Refreshing state... [id=imagebuilder_spot_fleet_role_staging]
aws_iam_policy.packer: Refreshing state... [id=arn:aws:iam::933752197999:policy/packer_staging]
aws_iam_user_policy_attachment.imagebuilder_vmimport: Refreshing state... [id=imagebuilder_worker_staging-20210121192045197600000002]
aws_iam_policy.spotfleet_iam_spot_policy: Refreshing state... [id=arn:aws:iam::933752197999:policy/spotfleet_iam_spot_policy_staging]
aws_cloudwatch_log_stream.external_composer_syslog: Refreshing state... [id=external_composer_syslog]
aws_iam_policy.vmimport_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_s3_staging]
aws_iam_instance_profile.external_worker: Refreshing state... [id=external_worker_staging]
aws_iam_policy.pozorbot_lambda_cloudwatch: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_lambda_cloudwatch_staging]
aws_iam_instance_profile.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_instance_profile.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_security_group.external_vpc_endpoints: Refreshing state... [id=sg-0be443e4c92c98b1c]
aws_iam_policy.pozorbot_client_sqs: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_client_sqs_staging]
aws_iam_instance_profile.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_policy.pozorbot_lambda_sqs: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_lambda_sqs_staging]
aws_vpc_endpoint.external_vpc_s3: Refreshing state... [id=vpce-0249da6b762fae5de]
aws_iam_role_policy_attachment.vmimport_ec2: Refreshing state... [id=vmimport_staging-20210121192045244900000003]
aws_security_group.external_workers: Refreshing state... [id=sg-0f578bf2872026f5d]
aws_iam_role_policy_attachment.spotfleet_iam_role_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656385800000003]
aws_iam_policy.pozorbot_read_secrets: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_read_secrets_staging]
aws_lambda_function.pozorbot_lambda: Refreshing state... [id=pozorbot_staging]
aws_iam_policy.external_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_worker_read_keys_staging]
aws_iam_policy.external_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_composer_read_keys_staging]
aws_vpc_endpoint.internal_vpc_s3: Refreshing state... [id=vpce-08d5fdb7cd26e5c94]
aws_security_group.internal_allow_egress: Refreshing state... [id=sg-0eb65fd8f2c17dba5]
aws_security_group.internal_allow_trusted: Refreshing state... [id=sg-084607083aaa39727]
aws_iam_user_policy_attachment.packer: Refreshing state... [id=packer_staging-20201204204656365500000001]
aws_iam_policy.internal_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_composer_read_keys_staging]
aws_iam_policy.internal_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_cloudwatch_logging_staging]
aws_iam_role_policy_attachment.vmimport_s3: Refreshing state... [id=vmimport_staging-20210121192044923500000001]
aws_iam_role_policy_attachment.spotfleet_iam_spot_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656553800000004]
aws_iam_policy.internal_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_worker_read_keys_staging]
aws_iam_role_policy_attachment.pozorbot_lambda_cloudwatch: Refreshing state... [id=pozorbot_lambda_role_staging-20210127132820714600000001]
aws_iam_role_policy_attachment.external_pozorbot_composer: Refreshing state... [id=external_worker_staging-20210127152215239700000003]
aws_iam_role_policy_attachment.external_pozorbot_worker: Refreshing state... [id=external_composer_staging-20210127152215237300000002]
aws_iam_role_policy_attachment.internal_pozorbot_composer: Refreshing state... [id=internal_worker_staging-20210127152215241500000004]
aws_iam_role_policy_attachment.internal_pozorbot_worker: Refreshing state... [id=internal_composer_staging-20210127152215216300000001]
aws_vpc_endpoint.external_vpc_secretsmanager: Refreshing state... [id=vpce-013676c2939c3d681]
aws_vpc_endpoint.external_vpc_cloudwatch_logs: Refreshing state... [id=vpce-0ffb71834c608a4e5]
aws_iam_policy.external_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_cloudwatch_logging_staging]
aws_iam_role_policy_attachment.pozorbot_lambda_sqs: Refreshing state... [id=pozorbot_lambda_role_staging-20210127130509124000000001]
aws_iam_role_policy_attachment.pozorbot_lambda_secrets: Refreshing state... [id=pozorbot_lambda_role_staging-20210127150546817300000001]
aws_security_group.external_composer: Refreshing state... [id=sg-0be4cfbfac3cc0022]
aws_iam_role_policy_attachment.external_composer_read_keys: Refreshing state... [id=external_composer_staging-20210113202541907800000001]
aws_iam_role_policy_attachment.external_worker_read_keys: Refreshing state... [id=external_worker_staging-20210113202541913700000002]
aws_vpc_endpoint.internal_vpc_secretsmanager: Refreshing state... [id=vpce-0d13154306549b1cd]
aws_vpc_endpoint.internal_vpc_cloudwatch_logs: Refreshing state... [id=vpce-01e031ba5033ab0c5]
aws_lambda_event_source_mapping.pozorbot_sqs: Refreshing state... [id=7ae0421e-5c59-4b9e-971a-aab448662f51]
aws_iam_role_policy_attachment.internal_composer_read_keys: Refreshing state... [id=internal_composer_staging-20201204204656559200000005]
aws_iam_role_policy_attachment.internal_cloudwatch_worker: Refreshing state... [id=internal_composer_staging-2020120420465704340000000a]
aws_iam_role_policy_attachment.internal_cloudwatch_composer: Refreshing state... [id=internal_worker_staging-2020120420465704850000000b]
aws_iam_role_policy_attachment.internal_worker_read_keys: Refreshing state... [id=internal_worker_staging-20201204204656366800000002]
aws_iam_policy.imagebuilder_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder_workers_s3_staging]
aws_ebs_volume.composer_external: Refreshing state... [id=vol-0daeecfc25da04a05]
aws_iam_role_policy_attachment.external_cloudwatch_worker: Refreshing state... [id=external_composer_staging-20210113203644029600000002]
aws_iam_role_policy_attachment.external_cloudwatch_composer: Refreshing state... [id=external_worker_staging-20210113203644009900000001]
aws_network_interface.composer_external: Refreshing state... [id=eni-02f250427cdd85dc7]
aws_network_interface.composer_internal: Refreshing state... [id=eni-07088640399f60f49]
aws_ebs_volume.composer_internal: Refreshing state... [id=vol-058d1cec56397f102]
aws_iam_user_policy_attachment.imagebuilder_s3: Refreshing state... [id=imagebuilder_worker_staging-2020120420465705150000000c]
aws_eip.lb: Refreshing state... [id=eipalloc-0f8be222c563c4767]
aws_instance.composer_external: Refreshing state... [id=i-0c064f46bdf5514bc]
aws_volume_attachment.composer_external: Refreshing state... [id=vai-3854467784]
aws_launch_template.worker_external_x86: Refreshing state... [id=lt-0195b4ef20679c780]
aws_spot_fleet_request.workers_external_x86: Refreshing state... [id=sfr-a1ec36af-90a8-4b54-8713-aea7afa9b80e]
aws_instance.composer_internal: Refreshing state... [id=i-09a84de392bf97ace]
aws_volume_attachment.composer_internal: Refreshing state... [id=vai-245504478]
aws_launch_template.worker_internal_x86: Refreshing state... [id=lt-0a23e96f3feb1649c]
aws_spot_fleet_request.workers_internal_x86: Refreshing state... [id=sfr-b4db8c56-4723-42e2-ac26-e56ce7040189]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_cloudinit_config.external_workers_cloud_init will be read during apply
  # (config refers to values not yet known)
 <= data "template_cloudinit_config" "external_workers_cloud_init"  {
      ~ id            = "3277100699" -> (known after apply)
      ~ rendered      = "H4sIAAAAAAAA/9R52XLjtp73varyDvgcf5Wkeihx0WL5xKkjSqRWUhJXUWemXCAIiRTBxSSordMvMjdzO483jzBFLW7Z3VknN/FNi8B/xw//Bd1NYopjyhiHFD+CqCA0SGFGa1Gwx94/gJsUsQezw9OdMlQkcWqqvY7m3FXKL8bCWR4k8SPgquw3lW8qDHNL9E3lKrsX5GmSB/RECymFyI9wTP8BVgHBMYzw010QB7SKVuu7z1xGBuN8hTNGilHiBfH6EbTcgN4QnEymeE9riCSFx6AkXgXrbypKEOEvjPv2lqZSKXKc5Y8VABhQWvAIMOKZcrECAAB57j/DgvpJFhyx9xziw4m2/GPAXZ77TJZD0Ol0OqKgHmGXOyBeKj97nXlH7HQ63c68u9+s5OGQ9FfduB0gMjhEdiaJmWHyZNKkod43OJy2vO7suOM2TtOO/TmZLZQUz7JA3asL0n9A9rRd0+RU9NhjW96phw/hau23V8VBdert4QcFNqcHwxLXDV9N5P1KW/QbwYCimj4nsSvJwTjVwzoJ0qQ+X1KRRuvOyzrUO83e0T+s3WbRUNrB3hju67a4KXSF7S/mR3WT4tUhsIsP+VD74PNmNg/HHbEohs7czTbkg+xbEZxss+3BmPJFPqXb2BE3vjvbHaYt3p5tYDr2am3fgC8zidvJh6Yp8/EC1WfrHbsO5m4zD1zZOLZUA+9toTFvP7yk86mtOGOUrpcZ0eFgMF7qik+P05biLbPpRDYXic51cOdQX/sUqdlUNIjb0LezlnA8si+iJvOoO61P2V3a2O1eZv52x8fUFVJjMqMepqMPVoOdz+I0Xhx0PV6m/FHeIcxz7mLfbMV+m8T+JFuuN7iFknk868j7GiJCU9JHh3VQzJC4+xByD05BHGVhvkCRhrvRJNQ2vXRjLHjcUEZcM+m18tEA1Wt2IzysJltPyS3fe+G6i0HfsqbpMVm7bLthOQGrLeQ0Xmo1Dlvrbk37YFsH6qycBzZbWVPkdRK+v1zFo8bR0czFaNRWliGM93tBapnTIJRGajs3NzzLHpvdw4EdroYvhjvixMaqtfIEiLRsUu8hx/TkYY0TD6rdlLlNCy2DTn86GqvucSGzhkBXD3sWc/OnJxDBTZL9M8OeD2kVJdHdW7xjj280uPYJ890z5smyN+RUQ2qUa8OZyG1kUk+bsiEG+4HR3E3D5uIh3tSWLZzM1LlUU9jduP7QGIPELTwYvFFW2WUBxc9lRrhcyxRS/xHUaJSer/dzmSOetzDLT5ahcxZ4BD9fDJ3qojmc9J67U0UZGk8PAoKrB5bFDb7B1906V1+1Vg131YCY9QTU5nj00Oba/IW7O1VmU13SruytVQMLTc9r1x+4BruCqO6yQlNooqYntF231cQ8fuC81XvlneeupBlPE52lE53raqY3MgKxp1kjUzeXozkrm9ppj6XdkBvppiZZktqb28vFkpUF3RyJS5ZYZk+dK7xzVC2xb4YNzuWXLI6UhtELea3vmy6viR6rabaZTlwuHcHBcmOEsqaZu/GcyKLHLl80y1LnIRnMDdnSTFnw2H2gsI10KXs54tKeulhuXFsV9L6/MULuZb7wZpZkNQ1LW2KTkyxDXcC+OjUWqejt0nKv/mYvlBeGNdI81optU7NNS5Y0SWa9SDnoG9m3BD8z+mwDW2lzzqqiyRJBk+WlHtKtHZLEi9Rp92TzqGuasrTkPdmUZOlEa7d75fc8lNV5LGa2JTu6pSrO0Z/YdqqaFolxLGpTUxUVbjRRIm+o9cS9s5CP3mY9dqzRxgoVXiVKYxn6e80099DcW7b0ICi9kYY31hHyaaII6d4YkIG58QWTONsJr44Ue7hHG9HCVmo47B4qHBIsKz3Mdwmr9rTIEZKjsSB1V1abFmctTU6M5yGZwL4nTgcyRSTVFbsdObZ2wANLN7r06IZLSbdpXRFQ5hzl8dKyCiVSc0X20i6xWLs3GmjcsqcRTzV4ebsMtcyWrZ4WWxN94I1N2+sbA+2oSyq0bTXyiGfrcgrVsF73WG+nEBnaxrDhHH3OXYgvitUZm9IytyWlvuzL0JA435ZJoBmiqi80W5HUoR6LgsaSnROTwrWI6XbpUYst3u1pW6vPHfAg2eKF30SSxlshN0OhPHLnad3lcwERi1oDK9T6lmxyo67Be6JiUs4xOd0aWL6+EDX3OApdYbkfHzt7LXKOc7N+sExV9FhLnNvy1JK4vrbwhqZFpC5Z6orU7s4JkbUwEZbG0lGEcLfst3Okt8cOWaZOSFKP1wqT62RqyHWnkicqlhXqC0+zTa7rmHJf33hEJesjNsTQ5XfjX+AVr7zawpPnQVswzaU6N7nu3HbqX79X+1eMztepqMUpr/KE6CxquHI6QeHwYNgchJK81yWiYHvvGwKxkYEE7Ui6hjUytVjd2bHJKoOhoHGa4LBa4kVrTjPVrS7LQTfaZ54hOqrZdpasxtsDtYv67b4+GPGKRGe6vTdUzhorC2en9vOtTkhsD1Dm9lPTGijb6SLduRtft6I9RQNzq7HczDDMsWmPBmaXTuHGguhoRRq7XECpLhjGkDNtak17o7E78Ikeyrm58Idzft8z+1bdDFXVMeSGuugIVr8RT3viRCceiy1xPp2nrMl76jzuCKpl6Uv7gVVNs25K6UGPO0c4IFtVHtWn1kjTeHrAtqrrCy+ahz4PBV/Vo2WBeEWw9Tav2oTTNj7FEtfsblTWCZPGmE0bmilz+iDZO6HHIVN1xoI8Ni3N9LptzT06By/0Fo4ZNkxuOXGIUncsX5kfR1M1ljfQHu3RxqwvN5qkh/OxHqu5oT8IaKA20EbeqguNdcJRoZKQmy+Udjc452TNbEhDSZVNoo20kPTmliafczk7fl8pBlPdeIK7vCxgaZLjrJrkbhEQr5pk6/fEnV5Pk3T9iWvxVYGrNutVjrvQ2FNtLGnPuj55HkuO/tzR1CeYxY9wlz/mGGWY5hGM4Rpnj0XOYJhThntsC0KrwXPtVrvdvlA9uhnenXpVpiWbGJOLfN0U9a42nBnDqfqsdNRO/1LmOmrvzyvLCzdHWZCWXT1zYWFQEkUw9phw7pCkfdXv6IaknMKldhTpeaZJ8nDxlFO4DuI1g/cUZzEkzC7Jwkv/fRO43lB7qmGKapfgMtdoX6VLXU0y9FfHJLU3mw5V49nUJk8+pWn+WKu99az66lkVRvCYxJdDrN32HV9T+cVClSYR+Xo78q8w2QT/cfmAhCQ77D17SQSDOAdP4F/gjmIY3ULm7t/AnV+41fIY36+fY/PlFrhqQBA8gbuvW40ggzJaTXHZZ12sOwv8w/b9ZXa8i3SUxAHN0NdD+S1Qym1wnt2KDJaYA6skA8MIrjEQSzU4A0EMOrZefeXqJSh/BFcMRCcdp3M+/ap5CSrKOfQk7rxW9WlEKq8Cuj5GIcBbnB2AwIIcoyT2cgBjD5BkDWgC8kNOkvVVZY4p8CCOkhgI7M1aSXym/Cy7U4YcQIRwnoNtAMuZE9AijjE5CcYYUB+D6Op5nhB8q6d0ywNpklHAP3B8adRlt/wrcgyg52WlcJIgSPwkpzf78Kzdi4L48aTis2EWzoLVAVAfUrDD32UYxAkFGNIgXpd8Z7NwlGQHkMSnryDOKYzRq33dgdQdX+49uC8v/qvqYHXlLfLy7H4Crcb/vzGsPNUGQAdEcH6zTH0cA7zHCNSKPKudXKq5QVxLk2OSuQl9hgRnN15IcV5k5xBmSUJPTw35Iac4AkEef0fBqiDkrb3ycCJdbD6xzDrGANRuLc9TiPCr4Q/sl4bTIHpj9y6gfhAD7q9w6YzGCzaCFdhhgGAMMgyRD5AXVz/PU5/vgDo1pO8jHx48HP/wCGwMdgEhAJIdPORgjSmAoM4KwMcZBi5GsEROsgKIBDimAOGM5m/DVB4nyHxMnpEXA3toDMCluL0z4jZyKxgQfAvQNIjXfyIYvyqyvAv1unC7lCU0QQk5J4GbjZxCWpR5rs4K744L5DkByamu5eAj6HbKgW4oD7sdQyohcslYmZ9HNQRrZ3+ZAqdlYgOf/pRTr7nwN53/Mjn+vxOpC3P/9dB1HHvgxJOXeLmKqb7Np9/lAMfbIEviMguCLcwC6BKcA5hhcE2O2DtB4/GV9Q+n028l1RpqU1WRVOMK5rkpmdKbCv1S4AK/K8e3bUctKFM9455TPXN1ibl0ERe5iqTrnb70dPc///Wf/w3ulak6NJ7LAds43c/Lgi5p1rArldnrsnLCNKTXz17HkK7vH5qkmxPj6f57uMtB/pKDHMceE+H8lAUY5mQ4U2QE3L96BZgrAeMm3gHc3V8Mu/vhIhUjPwH3Z9mVSlbEKPLOzx7IjxIPfNj/DsycSdkWy74vogw45zpECcBxeaqAYeJkdy4nv/JU+0ceXfdM7mNCzl3gL7263qCzrFoMLhKQBikub28lT4oM4a+/8VS+BX1M35QXMOxVK0NVNzpqV3oe9p7uv0dl4JlJfoLlY63GNdtVvlGvXv6tEUhxTmsRppDxIIW1qywm8H4odXTyHEdlfMoCGcMIVyuyOZm8dqtPd/cfv97AfmLuP94Y8+muFDfLgpiCpDgbHuPdjdzTmd/pmJ4q6aUYXbfLe3r/8Y3qT9WTSP0ShXcM1cr1V3nIOabMq6j7N2L+Hqd9Cc55qHDLAL2eOk2ANlDPwdDwOsgpzt7i4pS2S5rKu0tzurNvev+y5DHnJWYLSYHBv5f35boUeOD+428NTJ/Az2DzApgM3FX1E59OsyBe34Gfzt7dzkbPF8XPl9mousmTuHJl/zXKu98pDPwMThHPIsCsfq8Bla/Nb5f/nAEMAwua/J2A08MpSQ6gHH5Pmf48p+Rn0Fw2S8hcZxHQ7Zx6m2AVIEhxteLCHDfrgPEAA3788Udw//Hdk+4n8BO4/3g7ln66GWh+SU2ID6dx4Y2uvwSkX3k1+E1cnqNyeiJ4C8PPG3dfpzxj7DVCX4bizMCE+HAKxzvBKKP/R8HXON+A/Atv/n54PZXtMm9/BbVl3i/SG5LKt8CY9qZvu/kYY6/MkCiJtzgrK0Vw6vl6qg7K4peBXdmF7jAgsIiRX60gSE8Iv7uJ9KWB/3Qb/bJ+fLoDP/10a8LfKMTXQlukl7iCHGfbAOFLfGcZTstO9/0zxXc5yHCUUPye7XSR8wSFuByJfqHBuko7i7i8af3zfVgfH1os+0UwGeabyv8GAAD//6S7krOQHwAA" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ part {
          ~ content      = <<-EOT
                #cloud-config
                
                users:
                  - name: ec2-user
                    ssh_authorized_keys:
                      - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                      - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
                
                write_files:
                  - path: /tmp/cloud_init_vars
                    content: |
                      OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                      COMPOSER_COMMIT=7f5e36dd948150fac4b03636c6d39bb76e2e81df
                      OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                      COMPOSER_HOST=aws.composer.osbuild.org
                      COMPOSER_ADDRESS=172.31.64.11
                      WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:brew_keys-7FUeel
                      SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                      SYSTEM_HOSTNAME_PREFIX=staging-external-worker
                      COMPOSER_DIR=/etc/osbuild-composer
                      SECRETS_MANAGER_ENDPOINT_URL=https://secretsmanager.us-east-1.amazonaws.com/
                  - path: /etc/osbuild-composer/osbuild-composer.toml
                    content: |
                      [koji]
                      allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
                
                      [worker]
                      allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
                  - path: /etc/monitrc
                    content: |
                      # Monit configuration for Image Builder in AWS.
                      # Docs: https://mmonit.com/monit/documentation/monit.html
                
                      # Check every 30 seconds and log to syslog.
                      set daemon 30
                      set log syslog
                
                      # Allow access via ssh tunnel to see the monit console.
                      set httpd port 2812 and
                          use address localhost
                          allow admin:monit
                
                      # Verify that we're not eating all the memory on the instance.
                      CHECK SYSTEM $HOST
                        if memory usage > 75%
                          for 5 cycles
                          then exec /usr/local/bin/pozorbot_alert
                
                      # Ensure the root filesystem isn't full.
                      CHECK FILESYSTEM root PATH /
                        if space usage > 80%
                          for 5 times
                          within 15 cycles
                          then exec /usr/local/bin/pozorbot_alert
                
                      # Check to see if we can reach cdn.redhat.com.
                      # NOTE(mhayden): We will always get a 403 here because of client certs.
                      CHECK HOST rhel_cdn WITH ADDRESS cdn.redhat.com
                        if failed
                          ping
                          then exec /usr/local/bin/pozorbot_alert
                        if failed
                          port 443
                          protocol https
                          status = 403
                          with ssl options { CACERTIFICATEFILE: /etc/rhsm/ca/redhat-uep.pem }
                          then exec /usr/local/bin/pozorbot_alert
                  - path: /usr/local/bin/pozorbot_alert
                    content: |
                      #!/bin/bash
                      # Send alerts to pozorbot.
                      # Monit's environment variables are documented here:
                      # https://mmonit.com/monit/documentation/monit.html#ENVIRONMENT
                
                      QUEUE_URL=https://queue.amazonaws.com/933752197999/image-builder-pozorbot-staging
                      MESSAGE="🚨 $MONIT_EVENT for $MONIT_SERVICE on $MONIT_HOST at $MONIT_DATE"
                      RESULT=$(aws sqs send-message --queue-url $QUEUE_URL --message-body "$MESSAGE")
                      echo $RESULT
                
                runcmd:
                  - chmod +x /usr/local/bin/pozorbot_alert
                  - chmod 0700 /etc/monitrc
                  - systemctl enable --now monit
            EOT -> (known after apply)
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
    }

  # data.template_cloudinit_config.internal_workers_cloud_init will be read during apply
  # (config refers to values not yet known)
 <= data "template_cloudinit_config" "internal_workers_cloud_init"  {
      ~ id            = "989742770" -> (known after apply)
      ~ rendered      = "H4sIAAAAAAAA/9R52XLjtp73varyDvgcf5Wkeihx0WL5xKkjSqRWUhJXUWemXCAIiRTBxSSordMvMjdzO483jzBFLW7Z3VknN/FNi8B/xw//Bd1NYopjyhiHFD+CqCA0SGFGa1Gwx94/gJsUsQezw9OdMlQkcWqqvY7m3FXKL8bCWR4k8SPgquw3lW8qDHNL9E3lKrsX5GmSB/RECymFyI9wTP8BVgHBMYzw010QB7SKVuu7z1xGBuN8hTNGilHiBfH6EbTcgN4QnEymeE9riCSFx6AkXgXrbypKEOEvjPv2lqZSKXKc5Y8VABhQWvAIMOKZcrECAAB57j/DgvpJFhyx9xziw4m2/GPAXZ77TJZD0Ol0OqKgHmGXOyBeKj97nXlH7HQ63c68u9+s5OGQ9FfduB0gMjhEdiaJmWHyZNKkod43OJy2vO7suOM2TtOO/TmZLZQUz7JA3asL0n9A9rRd0+RU9NhjW96phw/hau23V8VBdert4QcFNqcHwxLXDV9N5P1KW/QbwYCimj4nsSvJwTjVwzoJ0qQ+X1KRRuvOyzrUO83e0T+s3WbRUNrB3hju67a4KXSF7S/mR3WT4tUhsIsP+VD74PNmNg/HHbEohs7czTbkg+xbEZxss+3BmPJFPqXb2BE3vjvbHaYt3p5tYDr2am3fgC8zidvJh6Yp8/EC1WfrHbsO5m4zD1zZOLZUA+9toTFvP7yk86mtOGOUrpcZ0eFgMF7qik+P05biLbPpRDYXic51cOdQX/sUqdlUNIjb0LezlnA8si+iJvOoO61P2V3a2O1eZv52x8fUFVJjMqMepqMPVoOdz+I0Xhx0PV6m/FHeIcxz7mLfbMV+m8T+JFuuN7iFknk868j7GiJCU9JHh3VQzJC4+xByD05BHGVhvkCRhrvRJNQ2vXRjLHjcUEZcM+m18tEA1Wt2IzysJltPyS3fe+G6i0HfsqbpMVm7bLthOQGrLeQ0Xmo1Dlvrbk37YFsH6qycBzZbWVPkdRK+v1zFo8bR0czFaNRWliGM93tBapnTIJRGajs3NzzLHpvdw4EdroYvhjvixMaqtfIEiLRsUu8hx/TkYY0TD6rdlLlNCy2DTn86GqvucSGzhkBXD3sWc/OnJxDBTZL9M8OeD2kVJdHdW7xjj280uPYJ890z5smyN+RUQ2qUa8OZyG1kUk+bsiEG+4HR3E3D5uIh3tSWLZzM1LlUU9jduP7QGIPELTwYvFFW2WUBxc9lRrhcyxRS/xHUaJSer/dzmSOetzDLT5ahcxZ4BD9fDJ3qojmc9J67U0UZGk8PAoKrB5bFDb7B1906V1+1Vg131YCY9QTU5nj00Oba/IW7O1VmU13SruytVQMLTc9r1x+4BruCqO6yQlNooqYntF231cQ8fuC81XvlneeupBlPE52lE53raqY3MgKxp1kjUzeXozkrm9ppj6XdkBvppiZZktqb28vFkpUF3RyJS5ZYZk+dK7xzVC2xb4YNzuWXLI6UhtELea3vmy6viR6rabaZTlwuHcHBcmOEsqaZu/GcyKLHLl80y1LnIRnMDdnSTFnw2H2gsI10KXs54tKeulhuXFsV9L6/MULuZb7wZpZkNQ1LW2KTkyxDXcC+OjUWqejt0nKv/mYvlBeGNdI81optU7NNS5Y0SWa9SDnoG9m3BD8z+mwDW2lzzqqiyRJBk+WlHtKtHZLEi9Rp92TzqGuasrTkPdmUZOlEa7d75fc8lNV5LGa2JTu6pSrO0Z/YdqqaFolxLGpTUxUVbjRRIm+o9cS9s5CP3mY9dqzRxgoVXiVKYxn6e80099DcW7b0ICi9kYY31hHyaaII6d4YkIG58QWTONsJr44Ue7hHG9HCVmo47B4qHBIsKz3Mdwmr9rTIEZKjsSB1V1abFmctTU6M5yGZwL4nTgcyRSTVFbsdObZ2wANLN7r06IZLSbdpXRFQ5hzl8dKyCiVSc0X20i6xWLs3GmjcsqcRTzV4ebsMtcyWrZ4WWxN94I1N2+sbA+2oSyq0bTXyiGfrcgrVsF73WG+nEBnaxrDhHH3OXYgvitUZm9IytyWlvuzL0JA435ZJoBmiqi80W5HUoR6LgsaSnROTwrWI6XbpUYst3u1pW6vPHfAg2eKF30SSxlshN0OhPHLnad3lcwERi1oDK9T6lmxyo67Be6JiUs4xOd0aWL6+EDX3OApdYbkfHzt7LXKOc7N+sExV9FhLnNvy1JK4vrbwhqZFpC5Z6orU7s4JkbUwEZbG0lGEcLfst3Okt8cOWaZOSFKP1wqT62RqyHWnkicqlhXqC0+zTa7rmHJf33hEJesjNsTQ5XfjX+AVr7zawpPnQVswzaU6N7nu3HbqX79X+1eMztepqMUpr/KE6CxquHI6QeHwYNgchJK81yWiYHvvGwKxkYEE7Ui6hjUytVjd2bHJKoOhoHGa4LBa4kVrTjPVrS7LQTfaZ54hOqrZdpasxtsDtYv67b4+GPGKRGe6vTdUzhorC2en9vOtTkhsD1Dm9lPTGijb6SLduRtft6I9RQNzq7HczDDMsWmPBmaXTuHGguhoRRq7XECpLhjGkDNtak17o7E78Ikeyrm58Idzft8z+1bdDFXVMeSGuugIVr8RT3viRCceiy1xPp2nrMl76jzuCKpl6Uv7gVVNs25K6UGPO0c4IFtVHtWn1kjTeHrAtqrrCy+ahz4PBV/Vo2WBeEWw9Tav2oTTNj7FEtfsblTWCZPGmE0bmilz+iDZO6HHIVN1xoI8Ni3N9LptzT06By/0Fo4ZNkxuOXGIUncsX5kfR1M1ljfQHu3RxqwvN5qkh/OxHqu5oT8IaKA20EbeqguNdcJRoZKQmy+Udjc452TNbEhDSZVNoo20kPTmliafczk7fl8pBlPdeIK7vCxgaZLjrJrkbhEQr5pk6/fEnV5Pk3T9iWOrAlvlHqocdyGxp9pY0p51ffI8lhz9uaOpTzCLH+Euf8wxyjDNIxjDNc4ei5zBMKcM99gWhFaD59qtdrt9oXp0M7w7tapMSzYxJhf5uinqXW04M4ZT9VnpqJ3+pcp11N6fV5YXbo6yIC2beubCwqAkimDsMeHcIUn7qt/RDUk5RUvtKNLzTJPk4eIpp3AdxGsmiCnOYkiYXZKFl/b7Jm69ofZUwxTVLrFlrsG+Spe6mmTor45Jam82HarGs6lNnnxK0/yxVtumCDOsxwlcoy6wzUa97XLIY9rHfdY6NrbVt55XXz2vloxVGMFjEl8Ounbbm3zNri8WqjSJyNdbln+FySb4j8sHJCTZYe/ZSyIYxDl4Av8CdxTD6BZWd/8G7vzCrZZn/X79HMAvt8BVA4LgCdx93WoEGZTRaorLXuxi3VngH7bvL7PjXaSjJA5ohr4eym+BUm6D83xXZLAEJlglGRhGcI2BWKrBGQhi0LH16itXL0H5I7gCJTrpOJ3z6VfNS1BRzqoncee1qk8jUnkV0PUxCgHe4uwABBbkGCWxlwMYe4Aka0ATkB9ykqyvKnNMgQdxlMRAYG/WSuIz5WfZnTLkACKE8xxsA1jOpYAWcYzJSTDGgPoYRFfP84TgWz2lWx5Ik4wC/oHjS6Muu+VfkWMAPS8rhZMEQeInOb3Zh2ftXhTEjycVnw2zcBasDoD6kIId/i7DIE4owJAG8brkO5uFoyQ7gCQ+fQVxTmGMXu3rDqTu+JIcwH2ZHV5VB6srb5GXZ/cTaDX+/41h5ak2ADoggvObZerjGOA9RqBW5Fnt5FLNDeJamhyTzE3oMyQ4u/FCivMiO4cwSxJ6eo7IDznFEQjy+DsKVgUhb+2VhxPpYvOJZdYxBqB2a3meQoRfDX9gvzScBtEbu3cB9YMYcH+FS2c0XrARrMAOAwRjkGGIfIC8uPp55vp8B9SpIX0f+fDg4fiHR2BjsAsIAZDs4CEHa0wBBHVWAD7OMHAxgiVykhVAJMAxBQhnNH8bpvI4QeZj8oy8GNhDYwAuBfCdEbeRW8GA4FuApkG8/hPB+FWR5V2o14XbpSyhCUrIOQncbOQU0qLMc3VWeHdcIM8JSE7FLwcfQbdTDn1DedjtGFIJkUvGyvw8qiFYO/vLFDgtExv49Keces2Fv+n8l8nx/51IXZj7r4eu49gDJ568xMtVTPVtPv0uBzjeBlkSl1kQbGEWQJfgHMAMg2tyxN4JGo+vrH84nX4rqdZQm6qKpBpXMM9NyZTelPGXAhfvy/Ftb1ILylTPuOdUz1xdYi6txkWuIul6py893f3Pf/3nf4N7ZaoOjedyCDdO9/OyoEuaNexKZfa6rJwwDen1s9cxpOsbiSbp5sR4uv8e7nKQv+Qgx7HHRDg/ZQGGORnOFBkB969eAeZKwLiJdwB39xfD7n64SMXIT8D9WXalkhUxirzz0wjyo8QDH/a/AzNnUrbFsu+LKAPOuQ5RAnBcnipgmDjZncvJrzzn/pGH2T2T+5iQc6v4Sy+zN+gsqxaDiwSkQYrL21vJkyJD+OvvQJVvQR/TN+UFDHvVylDVjY7alZ6Hvaf771EZeGaSn2D5WKtxzXaVb9Srl39rBFKc01qEKWQ8SGHtKosJvB9KHZ08x1EZn7JAxjDC1YpsTiavLe3T3f3Hr3e5n5j7jzfGfLorxc2yIKYgKc6Gx3h3I/d05nc6pqdKeilG1+3ynt5/fKP6U/UkUr9E4R1DtXL9VR5yjinzKur+jZi/x2lfgnOePNwyQK+nThOgDdRzMDS8DnKKs7e4OKXtkqby7tKc7uybAaAsecx5idlCUmDw7+V9uS4FHrj/+FtT1SfwM9i8ACYDd1X9xKfTLIjXd+Cns3e3A9TzRfHzZYCqbvIkrlzZf43y7ncKAz+DU8SzCDCr32tA5WtD3uU/cADDwIImfyfg9HBKkgMoJ+RTpj/PKfkZNJfNEjLXWQR0O6feJlgFCFJcrbgwx806YDzAgB9//BHcf3z37PsJ/ATuP97Orp9uBppfUhPiw2lceKPrLwHpV54WfhOX56ic3hHewvDzxt3XKc8Ye43Ql6E4MzAhPpzC8U4wyuj/UfA1zjcg/8Kbvx9eT2W7zNtfQW2Z94v0hqTyLTCmvenbbj7G2CszJEriLc7KShGcer6eqoOy+GVgV3ahOwwILGLkVysI0hPC724ifWngP91Gv6wfn+7ATz/dmvA3CvG10BbpJa4gx9k2QPgS31mG07LTff9M8V0OMhwlFL9nO13kPEEhLkeiX2iwrtLOIi4PX/98H9bHhxbLfhFMhvmm8r8BAAD//5B24/20HwAA" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ part {
          ~ content      = <<-EOT
                #cloud-config
                
                users:
                  - name: ec2-user
                    ssh_authorized_keys:
                      - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                      - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
                
                write_files:
                  - path: /tmp/cloud_init_vars
                    content: |
                      OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                      COMPOSER_COMMIT=7f5e36dd948150fac4b03636c6d39bb76e2e81df
                      OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                      COMPOSER_HOST=aws.composer.osbuild.org
                      COMPOSER_ADDRESS=10.30.18.11
                      WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:brew_keys-7FUeel
                      SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                      SYSTEM_HOSTNAME_PREFIX=staging-internal-worker
                      COMPOSER_DIR=/etc/osbuild-composer
                      SECRETS_MANAGER_ENDPOINT_URL=https://vpce-0d13154306549b1cd-9zxr7z5v.secretsmanager.us-east-1.vpce.amazonaws.com/
                  - path: /etc/osbuild-composer/osbuild-composer.toml
                    content: |
                      [koji]
                      allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
                
                      [worker]
                      allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
                  - path: /etc/monitrc
                    content: |
                      # Monit configuration for Image Builder in AWS.
                      # Docs: https://mmonit.com/monit/documentation/monit.html
                
                      # Check every 30 seconds and log to syslog.
                      set daemon 30
                      set log syslog
                
                      # Allow access via ssh tunnel to see the monit console.
                      set httpd port 2812 and
                          use address localhost
                          allow admin:monit
                
                      # Verify that we're not eating all the memory on the instance.
                      CHECK SYSTEM $HOST
                        if memory usage > 75%
                          for 5 cycles
                          then exec /usr/local/bin/pozorbot_alert
                
                      # Ensure the root filesystem isn't full.
                      CHECK FILESYSTEM root PATH /
                        if space usage > 80%
                          for 5 times
                          within 15 cycles
                          then exec /usr/local/bin/pozorbot_alert
                
                      # Check to see if we can reach cdn.redhat.com.
                      # NOTE(mhayden): We will always get a 403 here because of client certs.
                      CHECK HOST rhel_cdn WITH ADDRESS cdn.redhat.com
                        if failed
                          ping
                          then exec /usr/local/bin/pozorbot_alert
                        if failed
                          port 443
                          protocol https
                          status = 403
                          with ssl options { CACERTIFICATEFILE: /etc/rhsm/ca/redhat-uep.pem }
                          then exec /usr/local/bin/pozorbot_alert
                  - path: /usr/local/bin/pozorbot_alert
                    content: |
                      #!/bin/bash
                      # Send alerts to pozorbot.
                      # Monit's environment variables are documented here:
                      # https://mmonit.com/monit/documentation/monit.html#ENVIRONMENT
                
                      QUEUE_URL=https://queue.amazonaws.com/933752197999/image-builder-pozorbot-staging
                      MESSAGE="🚨 $MONIT_EVENT for $MONIT_SERVICE on $MONIT_HOST at $MONIT_DATE"
                      RESULT=$(aws sqs send-message --queue-url $QUEUE_URL --message-body "$MESSAGE")
                      echo $RESULT
                
                runcmd:
                  - chmod +x /usr/local/bin/pozorbot_alert
                  - chmod 0700 /etc/monitrc
                  - systemctl enable --now monit
            EOT -> (known after apply)
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
    }

  # data.template_file.external_workers_cloud_config will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "external_workers_cloud_config"  {
      ~ id       = "9b091824090c20fc96ae8f1cdbb77093f716f5a306c8136a6a5b7c11dc0417c6" -> (known after apply)
      ~ rendered = <<-EOT
            #cloud-config
            
            users:
              - name: ec2-user
                ssh_authorized_keys:
                  - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                  - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
            
            write_files:
              - path: /tmp/cloud_init_vars
                content: |
                  OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                  COMPOSER_COMMIT=7f5e36dd948150fac4b03636c6d39bb76e2e81df
                  OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                  COMPOSER_HOST=aws.composer.osbuild.org
                  COMPOSER_ADDRESS=172.31.64.11
                  WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:brew_keys-7FUeel
                  SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                  SYSTEM_HOSTNAME_PREFIX=staging-external-worker
                  COMPOSER_DIR=/etc/osbuild-composer
                  SECRETS_MANAGER_ENDPOINT_URL=https://secretsmanager.us-east-1.amazonaws.com/
              - path: /etc/osbuild-composer/osbuild-composer.toml
                content: |
                  [koji]
                  allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
            
                  [worker]
                  allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
              - path: /etc/monitrc
                content: |
                  # Monit configuration for Image Builder in AWS.
                  # Docs: https://mmonit.com/monit/documentation/monit.html
            
                  # Check every 30 seconds and log to syslog.
                  set daemon 30
                  set log syslog
            
                  # Allow access via ssh tunnel to see the monit console.
                  set httpd port 2812 and
                      use address localhost
                      allow admin:monit
            
                  # Verify that we're not eating all the memory on the instance.
                  CHECK SYSTEM $HOST
                    if memory usage > 75%
                      for 5 cycles
                      then exec /usr/local/bin/pozorbot_alert
            
                  # Ensure the root filesystem isn't full.
                  CHECK FILESYSTEM root PATH /
                    if space usage > 80%
                      for 5 times
                      within 15 cycles
                      then exec /usr/local/bin/pozorbot_alert
            
                  # Check to see if we can reach cdn.redhat.com.
                  # NOTE(mhayden): We will always get a 403 here because of client certs.
                  CHECK HOST rhel_cdn WITH ADDRESS cdn.redhat.com
                    if failed
                      ping
                      then exec /usr/local/bin/pozorbot_alert
                    if failed
                      port 443
                      protocol https
                      status = 403
                      with ssl options { CACERTIFICATEFILE: /etc/rhsm/ca/redhat-uep.pem }
                      then exec /usr/local/bin/pozorbot_alert
              - path: /usr/local/bin/pozorbot_alert
                content: |
                  #!/bin/bash
                  # Send alerts to pozorbot.
                  # Monit's environment variables are documented here:
                  # https://mmonit.com/monit/documentation/monit.html#ENVIRONMENT
            
                  QUEUE_URL=https://queue.amazonaws.com/933752197999/image-builder-pozorbot-staging
                  MESSAGE="🚨 $MONIT_EVENT for $MONIT_SERVICE on $MONIT_HOST at $MONIT_DATE"
                  RESULT=$(aws sqs send-message --queue-url $QUEUE_URL --message-body "$MESSAGE")
                  echo $RESULT
            
            runcmd:
              - chmod +x /usr/local/bin/pozorbot_alert
              - chmod 0700 /etc/monitrc
              - systemctl enable --now monit
        EOT -> (known after apply)
      ~ vars     = {
          ~ "composer_address"                = "172.31.64.11" -> (known after apply)
            # (8 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # data.template_file.internal_workers_cloud_config will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "internal_workers_cloud_config"  {
      ~ id       = "fc45d9aa76a0e88e3903faeba31d14762a369c9244c2980270bed571b4132fce" -> (known after apply)
      ~ rendered = <<-EOT
            #cloud-config
            
            users:
              - name: ec2-user
                ssh_authorized_keys:
                  - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                  - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
            
            write_files:
              - path: /tmp/cloud_init_vars
                content: |
                  OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                  COMPOSER_COMMIT=7f5e36dd948150fac4b03636c6d39bb76e2e81df
                  OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                  COMPOSER_HOST=aws.composer.osbuild.org
                  COMPOSER_ADDRESS=10.30.18.11
                  WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:brew_keys-7FUeel
                  SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                  SYSTEM_HOSTNAME_PREFIX=staging-internal-worker
                  COMPOSER_DIR=/etc/osbuild-composer
                  SECRETS_MANAGER_ENDPOINT_URL=https://vpce-0d13154306549b1cd-9zxr7z5v.secretsmanager.us-east-1.vpce.amazonaws.com/
              - path: /etc/osbuild-composer/osbuild-composer.toml
                content: |
                  [koji]
                  allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
            
                  [worker]
                  allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
              - path: /etc/monitrc
                content: |
                  # Monit configuration for Image Builder in AWS.
                  # Docs: https://mmonit.com/monit/documentation/monit.html
            
                  # Check every 30 seconds and log to syslog.
                  set daemon 30
                  set log syslog
            
                  # Allow access via ssh tunnel to see the monit console.
                  set httpd port 2812 and
                      use address localhost
                      allow admin:monit
            
                  # Verify that we're not eating all the memory on the instance.
                  CHECK SYSTEM $HOST
                    if memory usage > 75%
                      for 5 cycles
                      then exec /usr/local/bin/pozorbot_alert
            
                  # Ensure the root filesystem isn't full.
                  CHECK FILESYSTEM root PATH /
                    if space usage > 80%
                      for 5 times
                      within 15 cycles
                      then exec /usr/local/bin/pozorbot_alert
            
                  # Check to see if we can reach cdn.redhat.com.
                  # NOTE(mhayden): We will always get a 403 here because of client certs.
                  CHECK HOST rhel_cdn WITH ADDRESS cdn.redhat.com
                    if failed
                      ping
                      then exec /usr/local/bin/pozorbot_alert
                    if failed
                      port 443
                      protocol https
                      status = 403
                      with ssl options { CACERTIFICATEFILE: /etc/rhsm/ca/redhat-uep.pem }
                      then exec /usr/local/bin/pozorbot_alert
              - path: /usr/local/bin/pozorbot_alert
                content: |
                  #!/bin/bash
                  # Send alerts to pozorbot.
                  # Monit's environment variables are documented here:
                  # https://mmonit.com/monit/documentation/monit.html#ENVIRONMENT
            
                  QUEUE_URL=https://queue.amazonaws.com/933752197999/image-builder-pozorbot-staging
                  MESSAGE="🚨 $MONIT_EVENT for $MONIT_SERVICE on $MONIT_HOST at $MONIT_DATE"
                  RESULT=$(aws sqs send-message --queue-url $QUEUE_URL --message-body "$MESSAGE")
                  echo $RESULT
            
            runcmd:
              - chmod +x /usr/local/bin/pozorbot_alert
              - chmod 0700 /etc/monitrc
              - systemctl enable --now monit
        EOT -> (known after apply)
      ~ vars     = {
          ~ "composer_address"                = "10.30.18.11" -> (known after apply)
            # (8 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # aws_instance.composer_external must be replaced
-/+ resource "aws_instance" "composer_external" {
      ~ arn                          = "arn:aws:ec2:us-east-1:933752197999:instance/i-0c064f46bdf5514bc" -> (known after apply)
      ~ associate_public_ip_address  = true -> (known after apply)
      ~ availability_zone            = "us-east-1f" -> (known after apply)
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 2 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
      - hibernation                  = false -> null
      + host_id                      = (known after apply)
      ~ id                           = "i-0c064f46bdf5514bc" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
      + key_name                     = (known after apply)
      - monitoring                   = false -> null
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-02f250427cdd85dc7" -> (known after apply)
      ~ private_dns                  = "ip-172-31-64-11.ec2.internal" -> (known after apply)
      ~ private_ip                   = "172.31.64.11" -> (known after apply)
      ~ public_dns                   = "ec2-34-234-177-181.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                    = "34.234.177.181" -> (known after apply)
      ~ secondary_private_ips        = [] -> (known after apply)
      ~ security_groups              = [
          - "external_composer_staging",
        ] -> (known after apply)
      - source_dest_check            = true -> null
      ~ subnet_id                    = "subnet-0c016a02" -> (known after apply)
        tags                         = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🏗 External Composer (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ tenancy                      = "default" -> (known after apply)
      ~ user_data_base64             = "H4sIAAAAAAAA/9R72W7jSprmvYF6B3aeHFQ3TsvmIilTWZWNFkVSi82guURQZE/DIBlhcQkuSVILeeq8yNzM7TzePMIgKNnHdi6nqqYvqg0INmP541++fwvRi7JoSdGOnK4in7h8T9ukCur2Jk9OBP+JC8t9gYO6+/xOX+uqbECgzC3v3RV7GiFSN0lZfOKEa/4PV3+4Go1eLvrD1RNtJWmqsknaYW3QtkEU56Ro/8Q9JpQUQU4+v0uKpL2OHnfvftvl1EHRPJJ6pBZRiZNi94n7ECbtiwUDyy05tTcRLfd4FJXFY7L7w5We5OQr5n56uebqat+Quvl0xXEjjnHwiSOROGKDVxzHcU0TPwT7Ni7rpCf4ISPdsJb9jLh3TROP6ibg5vP5XJZAHyyELhJV9qjMzbk8n88Xc3NxSh+19ZouHxfFLInoqsvdWpVrB4r0btpm9tIRSPUBL+77o5B6U7eITXq/1StyXyfgBLZ0+TFyjdmNpVUy5vuZdgTdz9njLp497jvgjWfrn/VganQOkneTGJTa6dHaLifJqo1ubJMWoaolt5WdjWlSlWPTb+U2382/7DJ7PlX6uNuF0/1EnyUnZ30au3K6t3V+uTV7kFbksUvc/c/N2vo5FmFtZrdzeb9fe2ZYp/RnLUZ5cHeoD51jiPvGaA+FJ6dxeH/sjA+ie58G1S2+mcVO8OVeFY5aN4WaWGyj8f3uyO8SM5w2Sag5/QfgkJMrTczZxy+Vabi6dxtVO7+mdrBa3fq2Hre98UHHfm3caXBb2sKczLvxLm4jUBuyQ8OJfbj/IPU9/0W2NDFaGGODP1aT4/HLfXw4ikUbSpVzd99i0m5+RhPevC+qYtvZduFXYq8dIyIK4fY0/VDEM1rEd7W/S8mHqDSL+7l2uomoNFXtTbdL9veRfPw5Ez56e+rpW/glkNvsuLnLrFSpUmcrkom+Eaal8qHZrKLxjTvJuse7A9YbFOMvwmK7WiJkVH25C/nZBHkJb221qvCtG4Gg3eLG+tlFXes9eh/5+hEZEZ6X4tJ/LDaT3rPgdrOZ6X4WFKeTpH6ARpKpGzBrYCryfD9ddB2/flx/ccKNIE8ePzxiKYis+m6sRB7E2vpGkDvgTjUh/RD5yXxpbG5B2G813pHax48nngjm589cHqRl/e81wXHQXkdl/u413gkWJxNhNmB+ccY89ZW1ABx1wsbW97KQanRcTTVHTk4rZ3o0sun2Y5He+B9IeQ9M9Ubnj7fjj5Nbrgz3OEheHXZ1rJOWPLCIcHHLKmjjT9xNm1dn935gMeLhENTNwFl0jgKfuL9cGDVsGa7vlIeFoetr5/NHKQoeP/I8mYgTcRyOhfHjh8dJ+DgJCI+laCaI0ceZMBMvuxeGfm/YqvW0/cPjhEhTjGfjj8KEfwyicchLU2kaTbE0C8MPUyKSjwJ+fHv4/GGhWs7nO5tv72xhYUG8cRJZsdAG2tDfmLwGrWGObxeZsLGhpSIVKKbrb31ek2y4kX2eIqgAUxe9HiB5CbOJEIo+T3J94iiZaC1jGIqWjHnLcmF1FwrVJlj5qZNplgWPtybVZMz7XyyEgJnRleloyIKahPlTovOTytdwEwmVArZ+GrpAspdx6mTCF3OL75GKpg6yfAIFFTlgGyyB4WwrGR8rNjd+NZdpWwdtLMyjwoWWC5GmWqrG41zv7FSLkRTXzpKfEFRNTR7IkKeSpWm+nbUHN6MlzoGxGHjeLCDUVF/EGlQ1dVjrzhT2bGYaMAu5dpHm2QjoXh/fuW4FIKIFKWTLgEDWhc2dnuO1pcgnb6v1ON3demiTokwXAdUnfhafLAhPATwhV/0o6crGIinqA7Eqdak6OSu6gmksQeod7kSw0d31KUplRFDlePwp0IVIQqjqzGPJA8XKPansnS0dhxqYIgH5UJALM6N3wRLLxkprI1rZujvLPdfqyArZzqLtw8xXbbcd61JUe7126yO013PQ6BquFhTxrrJZWYKvWBQDR9QOfmbVroYUq0B39grfQhcvnZXV2yoIXBfkmGLX1qoAZOMx5vFRp1rgOuuJ18dCuJW/6Gh+C1W/cVV97C+1wFGF2NVoYjkysLeWq6tgbReyZPH06BV0HyIKw0XbWwUSQ8U6oKXQkVV5INt4GqmWiDLhPsq0TWhW41BspIiiFq1QZi2RBoXNwhGxrMNW8KBgoxWK7a1shf0mCyX/dNvPT1bu9SYcdwgCGfNINl3NQKqwtLZ4DRFVF9S3dXW2MCnVrKyUfMf3dCk7+stZE9mzW4/6lZfRCovWHgrzGmTCwlCxrCOU2VtsuVBYeFBb2immgO564shZKB5vv7NXftprbbFmJjMJQh+YUFiYrjf+tl+dnjFq7irZKioRiJTafDQJteouytad4wpBoGonW6U6cU+xI1E3ciLJ6unCQRtoFeDoFpDXV2vJEizJ460S5zvBguBga1qyyE81dmQPwJnn85borsAiWs6W9moj6mp7b7snBwjoVt96R7BsDjalhbuK6nBZQbTSD8a2OoZpbKP81EYreLB44d5x4C10Nyu4aI0gRUHUo9zi/W2gjiXHWQvQbZGhbG7DVUztTGvgNl6b4kmBSzSGGQCeo03Adi6h5aQwFPnOppgnSDYNs+KhiIFZzCWAkO27H3kA4RiqVWcX8z5Y0QPQNmMDbSxLbDviAtve4tzMYjGQYmDn/j4Sdcm1ZyJwqWClcUtUYbpIAe9l5eSWryYW1AR7VZ68DAsRBN6tpN1CZEG8mFlh73U4w1sPZhMo+Hce1cceinWz3xig0NLA3ZyiFI791FLtzLy1C9A49kcpWoFJlGoHsLV4L9vsAc0Ec6vPFsk5Jltwoq5VoEFqbayMKiaytHMs52+/yhQs0Jsi6vCS5oELYryE00Uy360XsuptrdjYlbv1Yn7+aD6NClCF4ni6VvTdrSKP9SS7fZ5fyI6/3VSee9w5BWq9HHWv9p8/oq6UY8Mpx15fHvW+osCpctBXGehL3lCqzOvLk96Xgq+UveeURy8tJ2B4rjLfqWLfKU8gLU+GUyXgFX+g8sVJjFeo821ZDpf4EOWUD5b8dL0CpeesBUBxhZexDXlNC3PQka3MB+5sf5b5/LG3oMcu6oxEVpxUOETiRgjcU3aXzzr/+EofcbikWbC1Ji/3Dx91csALeeG7/iHK4XStVnGYzE86+yhlB5yyMxbzTlfWp7WKAZq/1ZNshJK5M12f97frnZHIt5473unOnH2megqnerrb6em812155SDzlR2wu/niu4A3EpmGrlaFqpb5qw2NJH0WSiDBLm38JeoiXu581yq9rbn3xFn7Ug4ooSTIUYoXsondTRO4+s4W0WSt0r2ff5x+JbMmC15+qrxOvvO32c50T0UobZi+WyORu0j8vs5f8G5DXt3BFUrCJU3vYEuJU+5ulfURKLudl1P+1vwKU8PHcWcZdk9C1Je335q/fI66UuUgrTJfqVJmC8OpYuCwxFhODKUU9LTkQVqyJoIaTpXqacls1uvpj+jKFKSMbjkZ7JuWvK9Uue+Uku6UvdeXopdWCXDKnmHedxj9UvCcKvWdH/I78RlfA50q8Zyy8/pSYr6ip6XI9utKeWJ8X2gx3zoOfP+YbucrpQj6UtKVKmV0faaDvkrYGFCq3GN6YXKkVa4rJe+lpag7pfBjunLuOQM/oq8Mfsp00RnsjLTsGX/+oB/GX5UwPj1n8HPeV37IL6PF606V6z1LrlWup1XG+GRjQCk7L2WxgcWIcuI5FWV2ZvHkd+wWez2jUfaGw3iucq8fYpMIlEG/1EvLsd4Pckiec7apnw56/hG//BCfeoaniup9efKZfc6YOzK+/bQUjLNeO90ZYoLgO+UR/Bi/EsOm1w9yHQ2F0a5yLx1wdrrQmOgOs20VM9wwnPkMzz+kK1NdKcWLL4x9pYqBUlHQl2P/rJuJnzL8VdTrB1qizvCcMrl+rIdzDK8o45vpkdnbP/sX428MLnEeKKUA0nLMZADpoP8f0R0wow+6KE9MH35axfpwzmBDnsnuMcywcbbWKY/Ml36H7qAvpk9DYfgc5JP0sw8emX0MpRwzLOvD3ICHHihV7P3YbrzvMB8tOz1lvjBgY2wo7Hk4a9C1wXDNbMr0wvwuLU+/Y7fcGHDKYleVeD3DfdmzGMRwPOBuwMbZxwefYXhjfvFjP07A2e+7gRflbD+QlkfdqWJ9iG1VxnzRS4ecfWT+oSu/Fx/mvaEMMXLM/MBj8Uo51wCGwuw44Pg44M0pBeOc/1mMiv0f+vGcxb8EHL+dG6xtfAzFCQ0Lc7pWPAE4urRe7I5EUY+6Mj+9yinaTtAVKuqdTMnKouFQ80z6r2sZ2QPOfIJTfWfmWs/yoynO9pFkdZ5L93ilT9dL0AVbq/JErflOvlNMp1qa8ORYX+W13+i/yMVDbrVdxpdV+TmlUVruvk17LgKlkq0hHldLy6lUy6kWulOpDHOWUmksb7Bx06kWxjk3LRh+AOPJKUUrrTQrrWTdqRTrR/JvER8sZ0zWyVptKbHljb9E+3NdyWqp+bdtt2wpcWlmpFQzMkszMjgxUqwamdcZmXkyMks20rVgZNpiGEvRwkihaKRr0cj0sZHGCyOdS0bqSUZqjo3MXxrZRv6OrtVguzE8V6BGMvtxbffiE4moC1ytMVKwNNKoNzJ2Fl4aKdaM1FoaqSoYqdobqa8ZmXoyMn8xrBvWmp2R+aqRwbGRMn5hf15jHhc/0OdQZ2mo91xMjUROhzrWBXH4VZ14wfeSFsHWisOF7AQu3ntbS4hy2FxswequKlrGNMoF5gNf2cJV4NHYev1aRWO8RHt/ibLLXhSJWuE738OYDB1N3yERJWsN0KjwaZTIMt5ape9O+HNPQQ/hD2R9gW05XFk0yidsj+jb8sVW38GOahmwr9JQFI6hBGiUTF7bszvuLHXiGAXgmR7vcnAIt/KB2fMun/Vegapwae5DaVPcLWTVofrU2+L+R+suvdFLHb+tc/tgqXbA8bfB1iohBbLlTtKooMev9SDHxuBr5URnvVA65LF0qG3ONRzLESwPnp7qSBZ3Wb3A8vRQ9zhDTflKP56oT43leuqn6hT08ykQ4dR35lPfVad+DqdguZ7qTjbV02zqK+rUc+DUV7ypl6tTXdlN/SWcGo75ur5fImqkO4bfzsg3sZH7qZHKuZHuJkY6Z36ZGWl2PK9BuZFvMiP1xkaOYiOHnZGy9dGbflBmOWjCcsfQ67H6kOUtJpPCaqWhlhnyN6sTwbl2mPgsXyhl57N6NB3qm1fyG64+9VNzChx96vXm1HN2gy703Jv6LpzqPZMTTj0RTg327KhTQ4FTXYmmXh8NY346fy2/MueNNM6MXOeNXMuN3OSNVBWN3Bwb6bo3UjkzcsgbuXcy0vXYSCPRSHe9kaq8kXrisC81T29yyITVnr4y9L2sfuiH/tcZnlndyXJ6CoacXcXn/F2KrDf20vLos16jrxLjTT2jO3AKUm9qOPoUMD0MMjK5mN3NKejXU09kMq+nwImmQGFY2U09x5t6g96Y/N4b+2upkWuJkXqTIYal2cRIN7mRw6ORq0cj9XgjXTNZeyPdCUaudkYKT0Zq5UY6Hw/zuSq8tT9QqkQ/16mnoVZmzynL/YMeJP18F8DrFx9gNR7T14ALZagrWV3zGv9ONNX7+VRn8olwqrvmVGfYXrKeOZp6qTf1c3XQg858RTEHvIOe4SabgpxhZP3G/jvRSHFqpFpi5BY10og3Uo0aud4bqX40UpAYuSee80DUGem6M1KGmbVgpHJqpJQOe1/bn/UxzI9TvR/qIWHAgzP4/Bj0VXbpR4WhP2U+wOTuq2So74cxVrO/lp/5uJ97U7A0p75iToGiD7LpzA9yOPXS9VTP2bg62J7FC1+ZD/gAznrqO9/yfxAbaTQ5Y3p+fLpsMjO0suF4Z/LIRipd2hDISIXD3J1ZARtSlbiVYvJaZ4tYxjxdmC7eIEQ3IRTkW2HX6478xePhSVd8BbhWpksqj3icuFusQkRvbXEW2G4sevxEhhDpi2xjmVu8DDKEHLjZWLx6QhDJWMK6lwIjcK1tuAKB2SPRE4UU83Hp8RMQZEhykKURKEBzSw2kZjwShy8OptY2umVzmH85V8khFBy4xRtfeMOH2y6sPHZfflHg0viWUG1t56fAEuPSV3Uh2DE8y5IvYi2AgqyrWIGStoI8TXTesiy4kSFCsulYGzOzJHOLC59Hd6Y725iZZlnKuvd47RhpyHERql1nLXo8tRaZIHjppjaFyrgTJ5qxVCW0LaWAVjEp5p2bgySUQKar1Qnzm9LbVoeAryTYa3uPFw4YrSVfmdcRqkxDRXygoTwUsluPbvwQtiDq2i9Q3CywCw6AWrabrcd6jyc6kte62ohARC2GJq+vtClRZ1u9j79YwuYEUguELhKBPauQy/doi4BvVlOP17S7XisdlTooRwtdyMb6En8Jkqa3kO9Fqr+PUBz42bg2C/noOpsaOCYP3LEUFcDQs6azl+3BUdAXZ6uZJNeOizxWQx65oeBv3cw6moK8ILl/wO56DIWYN8UZsuCksbUq8eGp9l1wG/Azxd6Csb3yeH210YCrbSIJ9gEEt0CBfFhEt0CjCYHeIVhprbOqCgeCiaXuelttN1ijhb7cJJinPloKhs/j4k6yDNAD2S0wQktq+bx2sh2U+yJIoStQJGg8PladvlV708XAzDTZEqvCT2PJF30J85Y8fPmUytBE2vqO38j2FsuWqmVmjg2UxRZQ0dIXNORmDe/aMx4Uu2OYgsOCxnzkIAB49XQr8gecz1JjhRFEVEV0fQyyjRZK2LGhhsLClKKlnzvaugsQ7ozliUd81QfwtNBza3PX41Og4hNE2a0DNz5RfdVEYOHzE9fMNOBAvTO2lR9S/+hl2MLuurfzSRFo6sHrZtmd6NeG5mt66pe3PTBIKou6OLu3slmpq5bsHKuBlq2pYzPTckNFCxMKiplrMuaRdNFBY2aahHlQuJDeYYEuTKohW9Uka4vdJ7lgttHACkMbUrSgWWdsrdTq6dSl8Ybx5eQ0Q+KpdzNdwDlofQhWYTY+ughnoXpqncJPXHUjev3GJfDUfi3X+NYX4zJYmr2zRb6eUt7jowmhlWdv0Te/hHz7xaCJNM1RN5YJLebTCxO2hW5WNeZpSgpfswuzgy5KkWpKtqit9a2VEngcu+q6BuqsuxXAOJDmRw/FW+ziL757ugcZRVGxHluKVZtCHJg89UCvHRapL9gFSLGKU0uzegO2HVInXsC3R7KiJ19BiuHSLFqVR+TETtjHzp2EAETxfZjHKytbj30Xjk0EDKI2BwR93hfLW2uJIFHbtQetpSVuNIiqqYHAHe7NLhCrLoRCgiStsvNqi7sWYrhxQ7fpYI6WYAuQJ4GTKXhHR7GOEd24xlabRLsqRtkscBat4guVAvOq9GBloxUuA0nOoFSdYG5ZkTSXPBeMnUxbh0nLo2UrOyt68iQsh6mV2WLEh4UlRitq2gigRa4fwhUCoVCOrT4TdDXunS2+vxMo9ES6sWBlERet9N4vcW8tvG7WQn7XWVnlwhy41gpsUebHfhod0NKyrSUYB0lzG4nZyaRaT6jW6vDUhKpwBC6WTIe/vXxJrjmZ+Z0cWH5++6WLbd893Kqe/TC3wOegLj4Fx+ZTQ6KatE0eFMGO1J/2zYgETTsSPs0k6cNEFGYfZrPZZdUncmpJXQT0ISrzqmxIPbzeM9pNVH7nXI6zoWwvrPW9szbAgz4H8+XlzYA5UP7+k5t92ER1UrVJWYwuW0ZRmedBgUeZ6dFy9nS+Zzuq/rAybAfMdfXh3lK19fZz0wa7pNiNnkQYPYnwVkvK2vp8Q9ropmzCfULx24W2urBUx34WTQXKvbEGzgO07j7HbVs1n25uXst2/SzbdZAHfVkEx+Y6KvObly9rfOvIrwau2zKn336H4z+yMk3+8/IQUFoeCX7AZR4kRcN95v6De9eSIL++ULwu6927f+XexfvwOqzJ8e34sawzUn89xT2dEAXcZ+7dt7mOglFUt9cVyd9dPXF3Jvg38/dfxscbTedlkbR19G1V/sTpbJo7v/C2rwOGOu6xrLl1HuwIJ7NjSM0lBTd37evnXUoZNZ+4JwzkwxmDnYe/bnAZ7XNStAO589h13Ob06pnAIiZRxpEDqTtO4rmGRGWBGy4oMEfLHdeWXNM1tNw9HdmQlsMBycuCk/gXY2zxeeVvtOdM5VwQRaRpuEMScE0Tc+2+KAgdCBPCtTHh8ifJm5KSl+cwsTBXlXXLiR8FkTF1mWU/+4ZwAcY1I07LKKBx2bQv5oPz6ThPik/DEb8xhkidPHZcGwctdyR/rAlXlC1HgjYpdmzfmS2Sl3XHlcXwlBRNGxTRM3+Llbq4vXg+9565/vPRyePT3n3DbPdv3IfJ/3jBGLPqhIu6iJLmxXAbk4IjJxJxN/umvhlEugmT4qYq+7IOy/YhoKR+IYVaNPv6rMK6LNvh/cyma1qSc0lT/LHlHveUvuZXW9+pF56HLfdzZ8XdvOS8qYKIPDP+kf+a8TbJX/F9TNo4KTjhv1ikt671N4r3nC4qUjdJw7ztIu0hqG9oEn4v2P4DaOHskxcPSR65I+GioOBqEkQxF+Hi+rdX8X6LBMBw1H/O46DDpPiXT5xLuGNCKRfQY9A13I60XMCNeYmLSU24kEQB85/ykYtownQTkbptXmuTgZqrY0IfIlxw7tpZcXNFsVTbfsPES809BgklL920Sord36GMH5JkEWE8ll4O1WVbRiU9h8IXE00btHsW7ce89MZcXNNQrhzye8P9wi3mC9Vy1tp6MXdUhqRL3K7jJr+JgpuzvKM9qVh45379u4R6zgi/K/zXKeKfhqVh0MTPRrdJgblhT8Pw8kTm+nVW+WPDkeKQ1GXBcgF3COokCClpuKAm3FOKIHiAxqfnrX9zUvlJBWhtGUBXgfMEZhOqUH1Vp3zZkz15U5S8LL9uEpbwRuE54Y2eRBpdqqkLXV217flS/fzu//7v//V/uPe6AdbOg4pU4Az+eRmwVQutFyqL4ZeRAdNB+/SozB316dVZS7XhnfP5/T8Hx4ZrvjRcQwo8ykkzRIHRaGB8tK8p9/5ZKm70tGAUlrjj3r2/MPbuXy5USRSX3Psz7aurel9EOT6/MRvFeYm5n09/BWbOS/kPPP+2lBhx55AYtZQjBbMqNxoV5fGcVH/wlv/f8r7+adTEhNJzNfy9F/ZfoJPl7hHZl1yVVIR571VT7uuIfPv14KufuCVpXyVZbq1cX62B7czBQn1YK5/f/3PEFD+6awZYfrq5Eaaza3Eyvr78vqFBS5r2JidtMMJBG9w80Rol+F/YGfOmITnTDysTiiAn11cavLt7rto/v3v/y7cL+V9H7395wcyv7xi5+zopWq7cnxkvyPEF3cHm72zSDvXEJWc9TTM/ff/Lq6N/vR5I2hctvNlwffX0FzNyQ9rRM6n3r8j897D2RTnn5ipkCnq2elty1gqclWGRHcva9WtcDGGbrbl64zSDz77qgFjKG52HRoeA7gn3P5m/PA0lmHv/y+81jr9yf+HSL9yo5t5d28M+u62TYveO+7ezdC97xIfLwQ+XHvE6bcri6mn7j1a++yuJcX/hBo3XOTd6/GsZuPpWH3v5vx5uNAr2bfnfCTgKqWjZMdhkpDv3Kax0SR6TiEWAM3jOi16Wkdxi/nLd9VUYNGQ65kaYG3F//vOfufe/vPmngF+5f+Pe//KyR//1RXf35pTnIvV3znj1Nuo3T7gQ+r1zMtL9f/gAKXBVJkV7zma//Oh+4ddvuM03r3d+11deXeC8do6XU+++t/qM/meF/kB3TDlMdy/85BuH/6OA/kqV7QfbMSxWz9xgcrgpDjkRCuHKduaOer4d+m7T8ibZ7KvfMNK0ZR3syG/JZV89jbGK6PmC5yp55P6J29WkYlh4OvNX7qaqS1Zr7Iu2+dNQ41696NFU2eaSZmjCOlasFiRiNeRjUjdD/cnKMGetqxaXFNwv/PW1xPO//onD5dVTj9WyOuyF8M9nsJ+wJkE2/P2YnP/JjxJSccIVx+GyIFdXvzVKySO31ezX/SEX0JoEuOPyAA89+yDj6bF5SIrH8nvH5tljc316bF7NXw0sDOfpQfaNxpQJQjic1CRqWdfP+v+kaZJiuDTJM5zU3Oi1bs/k5hiznDeUdI9NG4RDOBsUznaeLfv+lxe8/PraQoxVTB6DPW0bjuf4d9xfuJYQbhS8IMp4YCRfCzUwYBEGR1u9S4r96dxxnM5dYE0YUkhUFtzIOjw3zedtDEsvtF2RepC3LIatUVwe2S7u4a2mPn018g2lvLybGaqhC2KThjvWSctK3CuOa8t9FL/afXNd1eUhYWwkxe4hYtBgggwx4HcXPib/MPHgr6mevuXtpD4k0VMGnON037S/zbYlR4dbEOb5AVeUBWuoChzUlwu2Qd9Jw9HhOi3JCO3YppBc/cQ1UVAUBA/orOoyJPj66ifOMRTj9YVDQdii83UfA1CdROfm+nKHVpD2WNYZR8mBUNaFNWXO6A+56F+5cN9yR9aQFn9suTg4EC5puTrZxS1XlMfrq2dPGrB9Bh++/P4qMI6CKrluyigj7TW+uWJe8bdvKw+krhNMrqOyeGR5bIjOe0q5P/+ZUw3t6j/sYel/Xt0NyrXbmgT559dPs48fplds8W+d2vkCdVQTWgb43E2QijXjb9n5I1NkXraEO99KP1t5sMWZz+b6BeU8aLJnKuc9/y5cX3ZdfadXfFp/Puqy7aKF39vzDcV95Umj0R+u/l8AAAD//622NAW6PgAA" -> "H4sIAAAAAAAA/9R713LjSprmvSL6HTB1aqNn4gwlGJJVrO6aGIIAaCRkCiYTBGYnFDApwiRMAaABTp8X2Zu93cfbR9hIkNKRVOZ0985FjyIYEtL8+Zvvd0loURYtKdqR3VXkE5fvaZtUft3e5MmJRH/ignJfRH7dfX6nr3VVhggoc9N9d8WeRpjUTVIWnzjhmv/D1R+uRqOXi/5w9URbSZqqbJJ2WOu3rR/GOSnaP3GPCSWFn5PP75Iiaa/Dx92733bZtV80j6QeqUVYRkmx+8R9CJL2xYKB5Zac2puQlvtoFJbFY7L7w5We5OQr5n56uebqat+Quvl0xXEjjnHwiSOhOGKDVxzHcU0TP/j7Ni7rpCfRQ0a6YS37GXHvmiYe1Y3PzefzuSyB3l8IXSiq7FGZG3N5Pp8v5sbilD5q6zVdPi6KWRLSVZc7tSrXNhLp3bTNrKUtkOpDtLjvj0LqTp0iNuj9Vq/IfZ2AE9jS5cfQgbMbU6vkiO9n2hF0P2ePu3j2uO+AO56tf9b9KexsLO8mMSi106O5XU6SVRveWAYtAlVLbisrG9OkKseG18ptvpt/2WXWfKr0cbcLpvuJPktO9vo0duR0b+n8cmv0IK3IY5c4+5+btflzLKLayG7n8n6/do2gTunPWoxz/+5QHzobivsGtofCldM4uD928IPo3Kd+dRvdzGLb/3KvCketmyJNLLbh+H535HeJEUybJNDs/gOwycmRJsbs45fKgI7u3obVzqup5a9Wt56lx20PP+iRV8M7DW1LS5iTeTfexW0IaijbNJhYh/sPUt/zX2RTE8MFHEP+WE2Oxy/38eEoFm0gVfbdfRuRdvMznvDGfVEV286yCq8Se+0YElEItqfphyKe0SK+q71dSj6EpVHcz7XTTUilqWptul2yvw/l48+Z8NHdU1ffoi++3GbHzV1mpkqV2luRTPSNMC2VD81mFY5vnEnWPd4dIr3BcfRFWGxXS4xh1Ze7gJ9NsJvw5larCs+8EQjeLW7Mnx3cte6j+5GvHzEMo3kpLr3HYjPpXRNtN5uZ7mV+cTpJ6gcEk0zdgFmDUpHn++mi6/j14/qLHWwEefL44TGS/NCs78ZK6KJIW98IcgecqSakH0IvmS/h5hYE/Vbjbal9/HjiiWB8/szlflrW/16TKPbb67DM373GO4nEyUSYDZhfnDFPPWUtAFudsLH1vSykGh1XU82Wk9PKnh5hNt1+LNIb7wMp74Gh3uj88Xb8cXLLlcE+8pNXh10d66QlDywiXNyy8tv4E3fT5tXZvR9YjHg4+HUzcBaeo8An7i8XRqElo/Wd8rCAur62P3+UQv/xI8+TiTgRx8FYGD9+eJwEjxOf8JEUzgQx/DgTZuJl9wLq99BSzaftHx4nRJpG0Wz8UZjwj344DnhpKk3DaSTNguDDlIjkoxA9vj18/rBQTfvzncW3d5awMFG0sRNZMfEGWcjbGLyGzGGObxeZsLGQqWIVKIbjbT1ekyy0kT2eYqQAQxfdHmB5ibKJEIgeT3J9YiuZaC5jFIimHPGm6aDqLhCqjb/yUjvTTBMdbw2qyRHvfTExBkZGV4atYRNpUsSfEp2fVJ4WNaFQKWDrpYEDJGsZp3YmfDG20T1W8dTGpkeQoGIbbP0lgPa2kqNjxebGr+YybWvjjRnxuHCQ6SCsqaaq8VGud1aqxViKa3vJTwiupgYPZMRTydQ0z8rag5PRMsoBXAw8bxYIaaonRhpSNXVY68wU9mxkGjAKuXaw5loY6G4f3zlOBRCmBSlkEyIg68LmTs+jtanIJ3er9VG6u3XxJsWZLgKqT7wsPpkInXx0wo76UdKVjUlS3PtiVepSdbJXdIXSWELUPdyJYKM761OYypjgynb5k68LoYRx1RnHkgeKmbtS2dtbOg40MMUC9pAgF0ZG7/xlJMOV1oa0snRnlruO2ZEVtuxF2weZp1pOO9alsHZ77dbDeK/noNG1qFpQzDvKZmUKnmLSCNiidvAys3Y0rJgFvrNW0S1yoqW9MntLBb7jgDyikWNplQ+y8Tjio6NONd+x1xO3j4VgK3/R8fwWqV7jqPrYW2q+rQqxo9HEtGVgbU1HV8HaKmTJ5OnRLeg+wBQFi7Y3CywGinnAS6Ejq/JAtvE0VE0RZ8J9mGmbwKjGgdhIIcUtXuHMXGINCZuFLUayjlrBRYKFVzi2trIZ9JsskLzTbT8/mbnbG2jcYQTkiMey4WgQq8LS3EZrhKm6oJ6lq7OFQalmZqXk2Z6rS9nRW86a0JrdutSr3IxWkWjukTCvQSYsoBrJOsaZtY1MBwkLF2lLK40ooLue2HIWiMfb7+yVn/aa20gzkpmEkAcMJCwMxx1/269Ozxg1dpVsFpUIREotPpwEWnUXZuvOdgTfV7WTpVKdOKfYlqgT2qFk9nRh4w0yC3B0CsTrq7VkCqbk8mYZ5TvBROBgaVqyyE91ZMsuQDPX403RWYFFuJwtrdVG1NX23nJONhDwrb51j2DZHCxKC2cV1sGyQnilH+C2OgZpbOH81IYrdDB54d620S1yNiu0aKGfYj/scW7y3tZXx5JtrwXktBgqm9tgFVMr0xq0jdeGeFLQEo9RBoBraxOwnUt4OSmgIt9ZNOIJlg1oVDwSI2AUcwlgbHnORx4gNEZq1VnFvPdX9AC0zRjijWmKbUccYFnbKDeyWPSlGFi5tw9FXXKsmQgcKphp3BJVmC5SwLtZObnlq4mJNMFalSc3i4QQAfdW0m4RNlG0mJlB73ZRFm1dlE2Q4N25VB+7ONaNfgNBoaW+szmFKRp7qalamXFrFaCxrY9SuAKTMNUOYGvybrbZA5oJxlafLZJzTDbRRF2rQEPU3JgZVQxsaudYzt9+lSlYoDdE3EVLmvsOiKMlmi6S+W69kFV3a8ZwV+7Wi/n5o3k0LEAViOPpWtF3t4o81pPs9nl+IdvedlO5znFnF7h1c9y92n/+iLpSjqFdjt2+POp9RYFd5aCvMtCXPFSqzO3Lk96XgqeUvWuXRzctJ2B4rjLPrmLPLk8gLU/QrhLwij9QeeIkjla48yxZDpbRIcwp7y/56XoFStdeC4BGVbSMLcRrWpCDjmxl3ndm+7PM54+1BX3k4A4msmKnwiEUN4LvnLK7fNZ5x1f6iIMlzfytOXm5f/iok0O0kBee4x3CHE3XahUHyfyks49SdsAuO7iYd7qyPq3VCOD5Wz3JMJCMneF4vLdd72Ai37rOeKfbc/aZ6ima6ulup6fzXrfklY2NV3aInM0XzwE8TGQaOFoVqFrmrTY0lPRZIIEkcmjjLXEX8nLnOWbpbo29K87al3IgCSd+jtNoIRuRs2l8R99ZIp6sVbr38o/Tr2TWZMHNT5XbyXfeNtsZzqkIpA3TdwsTuQvF7+v8Be8W4tUdWuEkWNL0DrWU2OXuVlkfgbLbuTnlb42vMDV8bGeWRc5JCPvy9lvzl89RV6ocpFXmKVXKbAHtKgY2S4zlBCqloKclD9KSNREU2lWqpyWzWa+nP6IrU5AyuuVksG9a8p5S5Z5dSrpd9m5fim5aJcAue4Z5z2b0S8G1q9Szf8jvxGN8DXSqxLXLzu1LifmKnpYi268r5YnxfaHFfOs48P1jup2nlCLoS0lXqpTR9ZgO+iphY0CpcpfphcmRVrmulLyblqJul8KP6cq5aw/8iJ4y+CnTRQfZGWnZM/68QT+MvyphfLr24Oe8p/yQX0aL1+0q13uWXKtcT6uM8cnGgFJ2bspiA4sR5cS1K8rszOLJ79gtdntGo+yhzXiucrcfYpMIlEG/1E3Lsd4Pckiufbaplw56/hG//BCfeoaniup9efKYfc6YOzK+vbQU4FmvnW4PMUHw7PIIfoxfiWHT7Qe5jlBhtKvcTQecnS40JrrNbFvFDDcMZx7D8w/pylRXSvHiC2NPqWKgVBT05dg762bipQx/FXX7gZaoMzynTK4f6+EcwyvK+GZ6ZPb2zv7F+BuDS5wHSimAtBwzGUA66P9HdAfM6IMuyhPTh5dWsT6cM9iQZ7K7DDNsnK21yyPzpd+hO+iL6RMqDJ+DfJJ+9sEjsw9UyjHDsj7MDXjogVLF7o/txns289Gy01PmCwM2xlBhz8NZg64hwzWzKdML87u0PP2O3XI44JTFripxe4b7smcxiOF4wN2AjbOPDz7D8Mb84sd+nICz33cDL8rZfiAtj7pdxfoQ26qM+aKbDjn7yPxDV34vPsx7qAwxcsz8wGXxSjnXAFBhdhxwfBzwZpcCPOd/FqNi74d+PGfxLwHHb+cGcxsfA3FCg8KYrhVXALYurRe7I1HUo67MT69yirYTdIWKeidTsjJpMNQ8k/7rWkZ2gT2fRKm+M3KtZ/nREGf7UDI716H7aKVP10vQ+VuzckWt+U6+Uwy7WhroZJtf5bXf6L/IxUNutRzGl1l5OaVhWu6+TXsuAqWSzSEeV0vTrlTTrha6XakMc6ZSaSxvsHHDrhbwnJsWDD+A8WSXoplWmplWsm5Xivkj+beY95czJutkrbaUWPLGW+L9ua5ktdT827ZbtpQ4NIMp1WBmajBDE5hGKszcDmbGCWamDNO1ADNtMYyleAFTJMJ0LcJMH8M0XsB0LsHUlWBqjGHmLWG2kb+ja9XfbqDrCBQmsx/Xdi8+oYg739EamIIlTMMeZuysaAnTSIOpuYSpKsBU7WHqaTBTTzDzFsO6Ya3RwcxTYYbGMGX8ov68xjgufqDPoc7ScO86EYWJnA51rAPi4Ks68YLvJS38rRkHC9n2nWjvbk0hzFFzsQWru6pwGdMwF5gPfGULR0FHuHX7tYrH0RLvvSXOLntxKGqFZ38PYzKyNX2HRZysNUDDwqNhIsvR1iw9Z8Kfewp6CH4g6wtsy8HKpGE+YXtEz5IvtvoOdlQTor5KA1E4BhKgYTJ5bc/uuDPViQ0LwDM93uXgEGzlA7PnXT7r3QJXwdLYB9KmuFvIqk31qbuN+h+tu/RGL3X8ts7t/aXaAdvb+luzRBTIpjNJw4Iev9aDHMPB18qJznqhdMhj6VDbnGs4liNYHjw91ZEs7rJ6geXpoe6xh5rylX5cUZ/C5XrqpeoU9PMpENHUs+dTz1GnXo6mYLme6nY21dNs6inq1LXR1FPcqZurU13ZTb0lmkLbeF3fLzGF6Y7ht4P5Joa5l8JUzmG6m8B0zvwyg2l2PK/BOcw3GUzdMcxxDHPUwZStD9/0gzLLQROWO4Zej9WHLG8xmRRWKw21zJC/WZ0IzrXDxGP5Qik7j9Wj6VDfvJIfOvrUS40psPWp2xtT194NutBzd+o5aKr3TE40dUU0hezZVqdQQVNdCaduHw5jXjp/Lb8y52EaZzDXeZhrOcwNHqaqCHNjDNN1D1M5gzniYe6eYLoewzQUYbrrYaryMHXFYV9qnN7kkAmrPT1l6HtZ/dAP/a89PLO6k+X0FAw5u4rP+bsUWW/spuXRY71GXyXwTT2j22gKUncKbX0KmB4GGZlczO7GFPTrqSsymddTYIdToDCs7Kau7U7dQW9MfveN/bUU5loCU3cyxLA0m8B0k8McHWGuHmHq8jBdM1l7mO4EmKsdTNEJpmYO0/l4mM9V4a39gVIl+rlOPQ21MntOWe4f9CDp57sAXr/4AKvxmL4GXChDXcnqmtf4t8Op3s+nOpNPRFPdMaY6w/aS9czh1E3dqZergx505iuKMeAd9Aw32RTkDCPrN/bfiTCNUphqCcxNCtOQh6lGYa73MNWPMAUJzF3xnAfCDqbrDqYMM2sBpnIKU0qHva/tz/oY5sep3g/1kDDgwR58fgz6Krv0o8LQnzIfYHL3VTLU98MYq9lfy8983MvdKVgaU08xpkDRB9l05gc5mrrpeqrnbFwdbM/ihafMB3wAez317G/5P4hhGk7OmJ4fny6bjAyvLDTeGTy2sEqXFgIyVtEwd2dUwEJUJU6lGLzWWWIkRzxdGE60wZhuAiTIt8Ku1235i8ujk654CnDMTJdUHvNR4mwjFWF6a4kz33Ji0eUnMkJYX2Qb09hGSz/D2EabjcmrJ4ywHEmR7qYA+o65DVbAN3osuqKQRnxcuvwE+BmWbGxqBAnI2FKI1YzH4vDFwdTchrdsLuJfzlVygAQbbaONJ7zhw2kXZh47L78ocGh8S6i2tvKTb4px6am64O8YnmXJEyPNR4Ksq5GCJG2FeJrovGmaaCMjjGXDNjdGZkrGNio8Ht8ZzmxjZJppKuve5bVjqGHbwbh27LXo8tRcZILgppvaECp4J040uFQlvC0ln1YxKeadk4MkkECmq9Up4jelu60OPl9JqNf2Li8cIryWPGVeh7gyoIp5X8N5IGS3Lt14AWpB2LVfkLhZRA44AGpaTrYe63000bG81tVGBCJuI2Tw+kqbEnW21fv4iylsTiA1QeBgEVizCjt8j7cYeEY1dXlNu+u10lapjXO80IVsrC+jL37S9Cb23FD19iGOfS8b10YhHx17UwPb4IEzlsICQD1rOmvZHmwFf7G3mkFy7bjIYzXgsRMI3tbJzKMhyAuSe4fIWY+REPOGOMMmmjSWViUeOtWeA259fqZYWzC2Vi6vrzYacLRNKKHeR+AWKIgPivAWaDQhyD34K621V1VhIzAx1V1vqe0m0mihLzdJxFMPLwXo8VFxJ5kQ9EB2igjjJTU9XjtZNs49EaTIESgWND46Vp2+VXvDiYCRabIpVoWXxpInelLEm/Lw5VMqIwNr6zt+I1vbSDZVLTPyCOIsNoGKl56gYSdreMea8aDYHYMUHBY05kMbA8Crp1uRP0T5LIWrCCNMVUzXRz/baIEU2RbScFAYUrj0cltbdz6OOrg88Ziveh+dFnpubu766OSr0Qnh7NZGG4+onmpgsPD4iWNkGrCR3sFt5QXUO7pZZEbOurfySeFr6sHtZtmd6NVQ8zQ99crbHkCSyqIuzu7NbFbqqinbx2qgZWnq2Mi0HKp4YSBBMXJNjngsXXTQGJkmRTwoHETvIoEuDKphS9Ukcxs5T3KhbKOBVYQsRPGCZh3cmqnZ06lD4w3jy85phsVT72S6EOWg9RBYBdn46OAoC9RTaxde4qgb0e03DkGn9mu5xreeGJf+0ujtLfb0lPIuH04IrVxri7/5JeTbLwYNrGm2ujENZDKfXhioLXSjqiOepqTwNKswOuTgFKuGZInaWt+aKUHHsaOua6DOulsBjH1pfnRxvI2c6IvnnO5BRnFYrMemYtaGEPsGT13Qa4dF6glWAdJIjVJTM3uI2g6rE9fn2yNZ0ZOnYAU6NAtX5RHbsR30sX0nYYBwfB/k8crM1mPPQWMDA0jU5oCRx3tieWsuMSJqu3aRuTTFjYZwNYUY3EW90fli1QVISLCkVVZebaOuRRHaOIHTdCjHS7AF2JXAyRDco62Yx5BuHLjVJuGuinE28+1Fq3hCpaC8Kl1UWXgVlb4kZ0iqTig3zVCaS64DxnamrYOk5fGyle0VPblSJAepmVliyAeFKYYralgY4EWuH4IVBoFQjs0+E3Q17u1tdH8nUOSKdGOiyiQOXum9V0a9uXC7WYv4XWdmlYNy4JgrsMWZF3tpeMBL0zKXYOwnzW0oZieDaj2hWqujUxOowhE4kWTY/O3lS3LNzozv5MDy89svXSzr7uFWda2HuQk++3XxyT82nxoS1qRtcr/wd6T+tG9GxG/akfBpJkkfJqIw+zCbzS6rPpFTS+rCpw9hmVdlQ+rh9Z7RbqLyO/tynIVka2Gu7+01BA/6HMyXlzcD5kD5+09u9kET1knVJmUxumwZhWWe+0U0ygyXlrOn813LVvWHFbRsMNfVh3tT1dbbz03r75JiN3oSYfQkwlstKWvz8w1pw5uyCfYJjd4utNSFqdrWs2gqUO7hGtgPyLz7HLdt1Xy6uXkt2/WzbNd+7vdl4R+b67DMb57OvoNIceb2YvVwB5fWt0nSctf8iNDzWx/f4v2rgeu2zOm3Xwb5j6xMk/+8PPiUlkcSPURl7idFw33m/oN71xI/v75QvC7r3bt/5d7F++A6qMnx7fixrDNSfz3FPZ0Q+txn7t23uQ79UVi31xXJ3109cXcm+Dfz91/GxxtN52WRtHX4bVX+xOlsmju/ObevfQZf7rGsuXXu7wgns2NIzSUFN3es6+ddShk2n7gny+fDGYOdh79uojLc56RoB3Lnseu4zenVM4FFTMKMIwdSd5zEcw0JyyJqOL+IOFruuLbkmq6h5e7pyIa0XOSTvCw4iX8xxhafV/5Ge85UzvlhSJqGOyQ+1zQx1+6LgtCBMCFcGxMuf5K8KSl5eQ4TK+Kqsm458aMgMqYus+xn3xDOj6KaEadl6NO4bNoX8/759ChPik/DEb8xhkmdPHZcG/stdyR/rAlXlC1H/DYpdmzfmS2Sl3XHlcXwlBRN6xfhM3+Llbq4vYQQ7j2LIc9HJ49Pe/cNs92/cR8m/+MFY8yqEy7sQkqaF8NtTAqOnEjI3eyb+mYQ6SZIipuq7Ms6KNsHn5L6hRRq0ezrswrrsmyHFz2brmlJziVN8ceWe9xT+ppfbX2nXngettzP7RV385LzpvJD8sz4R/5rxtskf8X3MWnjpOCE/2KR3rrW3yjec96pSN0kDfO2i7QHv76hSfC9qP0PoIWzT148JHnkjoQL/YKriR/GXBgV17+90/dbJADQVv85j/0uIsW/fOIcwh0TSjmfHv2u4Xak5XxuzEtcTGrCBST0mf+Uj1xIE6abkNRt81qbDNRcHRP6EEYF56ztFTdXFFO1rDdMvNTco59Q8tJNq6TY/R3K+CFJFhHGY+nlUF22ZVjScyh8MdG0frtn0X7MS2/MxTUN5cqhUGi4X7jFfKGa9lpbL+a2ypB0idt13OQ3oX9zlne0JxUL79yvf5dQzxnhd4X/OkX807A08Jv42egWKSJu2NMwvDyRuX6dVf7YcKQ4JHVZsFzAHfw68QNKGs6vCfeUIkg0QOPT89a/Oan8pAK8NiHQVWA/gdlAKlJfVSdf9mRP3hQlL+u4m4QlvFFwTnijJ5FGl7LsQldXLWu+VD+/+7//+3/9H+69DsHaflCxCuzBPy8Dlmri9UJlMfwyMmDab58elbmtPr2Da6oWurM/v/9n/9hwzZeGa0gRjXLSDFFgNBoYH+1ryr1/loobPS0YBWXUce/eXxh79y8XqiSMS+79mfbVVb0vwjw6v3obxnkZcT+f/grMnJfyH3j+bSkx4s4hMWwpRwpmVW40KsrjOan+4N8F/pYX/0+jJiaUnsvq7735/wKdLHePyL7kqqQizHuvmnJfh+Tb7xlf/cQtSfsqyXJr5fpqDSx7Dhbqw1r5/P6fQ6b40V0zwPLTzY0wnV2Lk/H15fcN9VvStDc5af1R5Lf+zROtURL9Cztj3jQkZ/phZULh5+T6SkN3d8/l/+d373/5dkfw6+j9Ly+Y+fUdI3dfJ0XLlfsz4wU5vqA72PydRdqhnrjkrKdp5qfvf3l19K/XA0nrooU3G66vnv5iRm5IO3om9f4Vmf8e1r4o59ylBUxBz1ZvS85cgbMyTLJjWbt+jYshbLM1V2+cZvDZV60US3mj89Do4NM94f4n85enoSTi3v/yex3or9xfuPQLN6q5d9fWsM9q66TYveP+7Szdy2bz4XLww6XZvE6bsrh62v6jle/+SmLcX7hB43XOjR7/WgauvtUQX/5BiBuN/H1b/ncCjkIqWnYMNhnpzn0KK12SxyRkEeAMnvOil2Ukt5i/XHd9FfgNmY65UcSNuD//+c/c+1/e/HfBr9y/ce9/edns//qiu3tzynOR+jtnvHqt9ZsnXAj93jkZ6f4/fIAUUVUmRXvOZr/86KLi12+4zTfviX7XV17dBL12jpdT7763+oz+Z4X+QHdMOUx3L/zkG4f/o4D+SpWtB8uGJqtnbiJyuCkOOREK4cqy57Z6vmb6btPyJtnsq98w0rRl7e/Ib8llXz2NsYro+YLnKnnk/onb1aRiWHg681fupqpLVmvsi7b501DjXr3o0VTZ4pJmaMI6VqwWJGQ15GNSN0P9ycowe62rJpcU3C/89bXE87/+iYvKq6ceq2V12Avhn89gP0FN/Gz4+zE5/7cgJaTihCuOi8qCXF391iglj9xWs173h5xPa+JHHZf70dCzDzKeHpuHpHgsv3dsnj0216fH5tX81cDCcJ7uZ99oTJkghIuSmoQt6/pZ/580TVIMlyZ5FiU1N3qt2zO5eRSxnDeUdI9N6wdDOBsUznaeLfv+lxe8/PraQozViDz6e9o2HM/x77i/cC0h3Mh/QZTxwEi+FmpgwCQMjpZ6lxT707njOJ27wJowpJCwLLiReXhums/bGJZeaLsi9SBvWQxbw7g8sl3cw1tNffpq5BtKeXk3M1RDF8QmDXesk5aVuFcc15b7MH61++a6qstDwthIit1DyKDBBBliwO8ufEz+YeLBX1M9fcvbSX1IwqcMOI/SfdP+NtuWHB1uQZjn+1xRFqyhKiK/vlywDfpOGo4O12lJRmjHNgXk6ieuCf2iINGAzqouAxJdX/3E2VCBry8cCsIWna/7GIDqJDw315c7tIK0x7LOOEoOhLIurClzRn/IRf/KBfuWO7KGtPhjy8X+gXBJy9XJLm65ojxeXz170oDtM/iiy++vAuPIr5Lrpgwz0l5HN1fMK/72beWB1HUSkeuwLB5ZHhui855S7s9/5lSoXf2HNSz9z6u7QblWWxM///z6afbxw/SKLf6tUztfoI5qQks/OncTpGLN+Ft2/sgUmZct4c630s9WHmxx5rO5fkE595vsmcp5z78L15ddV9/pFZ/Wn4+6bLto4ff2fENxX3nSaPSHq/8XAAD//znHcMgDPwAA" # forces replacement
      ~ vpc_security_group_ids       = [
          - "sg-0be4cfbfac3cc0022",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdb" -> null
          - encrypted             = true -> null
          - iops                  = 150 -> null
          - kms_key_id            = "arn:aws:kms:us-east-1:933752197999:key/9630f91f-f3c0-42eb-b65d-3defffc79926" -> null
          - tags                  = {
              - "AppCode"      = "IMGB-001"
              - "Name"         = "🏗 External Composer (staging)"
              - "ServiceOwner" = "Image Builder"
            } -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0daeecfc25da04a05" -> null
          - volume_size           = 50 -> null
          - volume_type           = "gp2" -> null
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }


      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-069d35316b9cdda8e" -> (known after apply)
          ~ volume_size           = 25 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # aws_instance.composer_internal must be replaced
-/+ resource "aws_instance" "composer_internal" {
      ~ arn                          = "arn:aws:ec2:us-east-1:933752197999:instance/i-09a84de392bf97ace" -> (known after apply)
      ~ associate_public_ip_address  = false -> (known after apply)
      ~ availability_zone            = "us-east-1a" -> (known after apply)
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 2 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
      - hibernation                  = false -> null
      + host_id                      = (known after apply)
      ~ id                           = "i-09a84de392bf97ace" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
      + key_name                     = (known after apply)
      - monitoring                   = false -> null
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-07088640399f60f49" -> (known after apply)
      ~ private_dns                  = "ip-10-30-18-11.ec2.internal" -> (known after apply)
      ~ private_ip                   = "10.30.18.11" -> (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      ~ secondary_private_ips        = [] -> (known after apply)
      ~ security_groups              = [] -> (known after apply)
      - source_dest_check            = true -> null
      ~ subnet_id                    = "subnet-04a176042c3118735" -> (known after apply)
        tags                         = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🏗 Internal Composer (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ tenancy                      = "default" -> (known after apply)
      ~ user_data_base64             = "H4sIAAAAAAAA/9R72ZKjSprmfZjVO9B5cqy67bQiWCRlKquyrYUALRE4weKOoKctDHAPsThLAlrg1HmRuZnbebx5hDFHijgRkcupqumL6jCTZeLL7//y/ZsLLcqiJUU7crqKfOLyPW2TKqjbmzw5EfwnLiz3BQ7q7vM7fa2rsgGBMre8d1fsaYRI3SRl8YkTrvk/XP3hajR6uegPV0+0laSpyiZph7VB2wZRnJOi/RP3mFBSBDn5/C4pkvY6ety9+22XUwdF80jqkVpEJU6K3SfuQ5i0LxYMLLfk1N5EtNzjUVQWj8nuD1d6kpOvmPvp5Zqrq31D6ubTFceNOMbBJ45E4ogNXnEcxzVN/BDs27isk57gh4x0w1r2N+LeNU08qpuAm8/nc1kCfbAQukhU2aMyN+fyfD5fzM3FKX3U1mu6fFwUsySiqy53a1WuHSjSu2mb2UtHINUHvLjvj0LqTd0iNun9Vq/IfZ2AE9jS5cfINWY3llbJmO9n2hF0P2ePu3j2uO+AN56tf9aDqdE5SN5NYlBqp0dru5wkqza6sU1ahKqW3FZ2NqZJVY5Nv5XbfDf/ssvs+VTp424XTvcTfZacnPVp7Mrp3tb55dbsQVqRxy5x9z83a+vnWIS1md3O5f1+7ZlhndKftRjlwd2hPnSOIe4boz0UnpzG4f2xMz6I7n0aVLf4ZhY7wZd7VThq3RRqYrGNxve7I79LzHDaJKHm9B+AQ06uNDFnH79UpuHq3m1U7fya2sFqdevbetz2xgcd+7Vxp8FtaQtzMu/Gu7iNQG3IDg0n9uH+g9T3/BfZ0sRoYYwN/lhNjscv9/HhKBZtKFXO3X2LSbv5GU14876oim1n24Vfib12jIgohNvT9EMRz2gR39X+LiUfotIs7ufa6Sai0lS1N90u2d9H8vHnTPjo7amnb+GXQG6z4+Yus1KlSp2tSCb6RpiWyodms4rGN+4k6x7vDlhvUIy/CIvtaomQUfXlLuRnE+QlvLXVqsK3bgSCdosb62cXda336H3k60dkRHheikv/sdhMes+C281mpvtZUJxOkvoBGkmmbsCsganI8/100XX8+nH9xQk3gjx5/PCIpSCy6ruxEnkQa+sbQe6AO9WE9EPkJ/OlsbkFYb/VeEdqHz+eeCKYnz9zeZCW9b/XBMdBex2V+bvXeCdYnEyE2YD5xRnz1FfWAnDUCRtb38tCqtFxNdUcOTmtnOnRyKbbj0V6438g5T0w1RudP96OP05uuTLc4yB5ddjVsU5a8sAiwsUtq6CNP3E3bV6d3fuBxYiHQ1A3A2fROQp84v5yYdSwZbi+Ux4Whq6vnc8fpSh4/MjzZCJOxHE4FsaPHx4n4eMkIDyWopkgRh9nwky87F4Y+r1hq9bT9g+PEyJNMZ6NPwoT/jGIxiEvTaVpNMXSLAw/TIlIPgr48e3h84eFajmf72y+vbOFhQXxxklkxUIbaEN/Y/IatIY5vl1kwsaGlopUoJiuv/V5TbLhRvZ5iqACTF30eoDkJcwmQij6PMn1iaNkorWMYShaMuYty4XVXShUm2Dlp06mWRY83ppUkzHvf7EQAmZGV6ajIQtqEuZPic5PKl/DTSRUCtj6aegCyV7GqZMJX8wtvkcqmjrI8gkUVOSAbbAEhrOtZHys2Nz41VymbR20sTCPChdaLkSaaqkaj3O9s1MtRlJcO0t+QlA1NXkgQ55Klqb5dtYe3IyWOAfGYuB5s4BQU30Ra1DV1GGtO1PYs5lpwCzk2kWaZyOge31857oVgIgWpJAtAwJZFzZ3eo7XliKfvK3W43R366FNijJdBFSf+Fl8siA8BfCEXPWjpCsbi6SoD8Sq1KXq5KzoCqaxBKl3uBPBRnfXpyiVEUGV4/GnQBciCaGqM48lDxQr96Syd7Z0HGpgigTkQ0EuzIzeBUssGyutjWhl6+4s91yrIytkO4u2DzNftd12rEtR7fXarY/QXs9Bo2u4WlDEu8pmZQm+YlEMHFE7+JlVuxpSrALd2St8C128dFZWb6sgcF2QY4pdW6sCkI3HmMdHnWqB66wnXh8L4Vb+oqP5LVT9xlX1sb/UAkcVYlejieXIwN5arq6CtV3IksXTo1fQfYgoDBdtbxVIDBXrgJZCR1blgWzjaaRaIsqE+yjTNqFZjUOxkSKKWrRCmbVEGhQ2C0fEsg5bwYOCjVYotreyFfabLJT8020/P1m515tw3CEIZMwj2XQ1A6nC0triNURUXVDf1tXZwqRUs7JS8h3f06Xs6C9nTWTPbj3qV15GKyxaeyjMa5AJC0PFso5QZm+x5UJh4UFtaaeYArrriSNnoXi8/c5e+WmvtcWamcwkCH1gQmFhut742351esaouatkq6hEIFJq89Ek1Kq7KFt3jisEgaqdbJXqxD3FjkTdyIkkq6cLB22gVYCjW0BeX60lS7Akj7dKnO8EC4KDrWnJIj/V2JE9AGeez1uiuwKLaDlb2quNqKvtve2eHCCgW33rHcGyOdiUFu4qqsNlBdFKPxjb6himsY3yUxut4MHihXvHgbfQ3azgojWCFAVRj3KL97eBOpYcZy1At0WGsrkNVzG1M62B23htiicFLtEYZgB4jjYB27mElpPCUOQ7m2KeINk0zIqHIgZmMZcAQrbvfuQBhGOoVp1dzPtgRQ9A24wNtLEsse2IC2x7i3Mzi8VAioGd+/tI1CXXnonApYKVxi1RhekiBbyXlZNbvppYUBPsVXnyMixEEHi3knYLkQXxYmaFvdfhDG89mE2g4N95VB97KNbNfmOAQksDd3OKUjj2U0u1M/PWLkDj2B+laAUmUaodwNbivWyzBzQTzK0+WyTnmGzBibpWgQaptbEyqpjI0s6xnL/9KlOwQG+KqMNLmgcuiPESThfJfLdeyKq3tWJjV+7Wi/n5o/k0KkAViuPpWtF3t4o81pPs9nl+ITv+dlN57nHnFKj1ctS92n/+iLpSjg2nHHt9edT7igKnykFfZaAveUOpMq8vT3pfCr5S9p5THr20nIDhucp8p4p9pzyBtDwZTpWAV/yByhcnMV6hzrdlOVziQ5RTPljy0/UKlJ6zFgDFFV7GNuQ1LcxBR7YyH7iz/Vnm88fegh67qDMSWXFS4RCJGyFwT9ldPuv84yt9xOGSZsHWmrzcP3zUyQEv5IXv+ocoh9O1WsVhMj/p7KOUHXDKzljMO11Zn9YqBmj+Vk+yEUrmznR93t+ud0Yi33rueKc7c/aZ6imc6ulup6fzXrfllYPMV3bA7uaL7wLeSGQauloVqlrmrzY0kvRZKIEEu7Txl6iLeLnzXav0tubeE2ftSzmghJIgRyleyCZ2N03g6jtbRJO1Svd+/nH6lcyaLHj5qfI6+c7fZjvTPRWhtGH6bo1E7iLx+zp/wbsNeXUHVygJlzS9gy0lTrm7VdZHoOx2Xk75W/MrTA0fx51l2D0JUV/efmv+8jnqSpWDtMp8pUqZLQynioHDEmM5MZRS0NOSB2nJmghqOFWqpyWzWa+nP6IrU5AyuuVksG9a8r5S5b5TSrpT9l5fil5aJcApe4Z532H0S8FzqtR3fsjvxGd8DXSqxHPKzutLifmKnpYi268r5YnxfaHFfOs48P1jup2vlCLoS0lXqpTR9ZkO+iphY0Cpco/phcmRVrmulLyXlqLulMKP6cq55wz8iL4y+CnTRWewM9KyZ/z5g34Yf1XC+PScwc95X/khv4wWrztVrvcsuVa5nlYZ45ONAaXsvJTFBhYjyonnVJTZmcWT37Fb7PWMRtkbDuO5yr1+iE0iUAb9Ui8tx3o/yCF5ztmmfjro+Uf88kN86hmeKqr35cln9jlj7sj49tNSMM567XRniAmC75RH8GP8SgybXj/IdTQURrvKvXTA2elCY6I7zLZVzHDDcOYzPP+Qrkx1pRQvvjD2lSoGSkVBX479s24mfsrwV1GvH2iJOsNzyuT6sR7OMbyijG+mR2Zv/+xfjL8xuMR5oJQCSMsxkwGkg/5/RHfAjD7oojwxffhpFevDOYMNeSa7xzDDxtlapzwyX/oduoO+mD4NheFzkE/Szz54ZPYxlHLMsKwPcwMeeqBUsfdju/G+w3y07PSU+cKAjbGhsOfhrEHXBsM1synTC/O7tDz9jt1yY8Api11V4vUM92XPYhDD8YC7ARtnHx98huGN+cWP/TgBZ7/vBl6Us/1AWh51p4r1IbZVGfNFLx1y9pH5h678XnyY94YyxMgx8wOPxSvlXAMYCrPjgOPjgDenFIxz/mcxKvZ/6MdzFv8ScPx2brC28TEUJzQszOla8QTg6NJ6sTsSRT3qyvz0KqdoO0FXqKh3MiUri4ZDzTPpv65lZA848wlO9Z2Zaz3Lj6Y420eS1Xku3eOVPl0vQRdsrcoTteY7+U4xnWppwpNjfZXXfqP/IhcPudV2GV9W5eeURmm5+zbtuQiUSraGeFwtLadSLada6E6lMsxZSqWxvMHGTadaGOfctGD4AYwnpxSttNKstJJ1p1KsH8m/RXywnDFZJ2u1pcSWN/4S7c91Jaul5t+23bKlxKWZkVLNyCzNyODESLFqZF5nZObJyCzZSNeCkWmLYSxFCyOFopGuRSPTx0YaL4x0LhmpJxmpOTYyf2lkG/k7ulaD7cbwXIEayezHtd2LTySiLnC1xkjB0kij3sjYWXhppFgzUmtppKpgpGpvpL5mZOrJyPzFsG5Ya3ZG5qtGBsdGyviF/XmNeVz8QJ9DnaWh3nMxNRI5HepYF8ThV3XiBd9LWgRbKw4XshO4eO9tLSHKYXOxBau7qmgZ0ygXmA98ZQtXgUdj6/VrFY3xEu39Jcoue1EkaoXvfA9jMnQ0fYdElKw1QKPCp1Eiy3hrlb474c89BT2EP5D1BbblcGXRKJ+wPaJvyxdbfQc7qmXAvkpDUTiGEqBRMnltz+64s9SJYxSAZ3q8y8Eh3MoHZs+7fNZ7BarCpbkPpU1xt5BVh+pTb4v7H6279EYvdfy2zu2DpdoBx98GW6uEFMiWO0mjgh6/1oMcG4OvlROd9ULpkMfSobY513AsR7A8eHqqI1ncZfUCy9ND3eMMNeUr/XiiPjWW66mfqlPQz6dAhFPfmU99V536OZyC5XqqO9lUT7Opr6hTz4FTX/GmXq5OdWU39Zdwajjm6/p+iaiR7hh+OyPfxEbup0Yq50a6mxjpnPllZqTZ8bwG5Ua+yYzUGxs5io0cdkbK1kdv+kGZ5aAJyx1Dr8fqQ5a3mEwKq5WGWmbI36xOBOfaYeKzfKGUnc/q0XSob17Jb7j61E/NKXD0qdebU8/ZDbrQc2/qu3Cq90xOOPVEODXYs6NODQVOdSWaen00jPnp/LX8ypw30jgzcp03ci03cpM3UlU0cnNspOveSOXMyCFv5N7JSNdjI41EI931RqryRuqJw77UPL3JIRNWe/rK0Pey+qEf+l9neGZ1J8vpKRhydhWf83cpst7YS8ujz3qNvkqMN/WM7sApSL2p4ehTwPQwyMjkYnY3p6BfTz2RybyeAieaAoVhZTf1HG/qDXpj8ntv7K+lRq4lRupNhhiWZhMj3eRGDo9Grh6N1OONdM1k7Y10Jxi52hkpPBmplRvpfDzM56rw1v5AqRL9XKeehlqZPacs9w96kPTzXQCvX3yA1XhMXwMulKGuZHXNa/w70VTv51OdySfCqe6aU51he8l65mjqpd7Uz9VBDzrzFcUc8A56hptsCnKGkfUb++9EI8WpkWqJkVvUSCPeSDVq5HpvpPrRSEFi5J54zgNRZ6TrzkgZZtaCkcqpkVI67H1tf9bHMD9O9X6oh4QBD87g82PQV9mlHxWG/pT5AJO7r5Khvh/GWM3+Wn7m437uTcHSnPqKOQWKPsimMz/I4dRL11M9Z+PqYHsWL3xlPuADOOup73zL/0FspNHkjOn58emyyczQyobjnckjG6l0aUMgIxUOc3dmBWxIVeJWislrnS1iGfN0Ybp4gxDdhFCQb4VdrzvyF4+HJ13xFeBamS6pPOJx4m6xChG9tcVZYLux6PETGUKkL7KNZW7xMsgQcuBmY/HqCUEkYwnrXgqMwLW24QoEZo9ETxRSzMelx09AkCHJQZZGoADNLTWQmvFIHL44mFrb6JbNYf7lXCWHUHDgFm984Q0fbruw8th9+UWBS+NbQrW1nZ8CS4xLX9WFYMfwLEu+iLUACrKuYgVK2gryNNF5y7LgRoYIyaZjbczMkswtLnwe3ZnubGNmmmUp697jtWOkIcdFqHadtejx1FpkguClm9oUKuNOnGjGUpXQtpQCWsWkmHduDpJQApmuVifMb0pvWx0CvpJgr+09XjhgtJZ8ZV5HqDINFfGBhvJQyG49uvFD2IKoa79AcbPALjgAatluth7rPZ7oSF7raiMCEbUYmry+0qZEnW31Pv5iCZsTSC0QukgE9qxCLt+jLQK+WU09XtPueq10VOqgHC10IRvrS/wlSJreQr4Xqf4+QnHgZ+PaLOSj62xq4Jg8cMdSVABDz5rOXrYHR0FfnK1mklw7LvJYDXnkhoK/dTPraAryguT+AbvrMRRi3hRnyIKTxtaqxIen2nfBbcDPFHsLxvbK4/XVRgOutokk2AcQ3AIF8mER3QKNJgR6h2Cltc6qKhwIJpa662213WCNFvpyk2Ce+mgpGD6PizvJMkAPZLfACC2p5fPayXZQ7osgha5AkaDx+Fh1+lbtTRcDM9NkS6wKP40lX/QlzFvy8OVTKkMTaes7fiPbWyxbqpaZOTZQFltARUtf0JCbNbxrz3hQ7I5hCg4LGvORgwDg1dOtyB9wPkuNFUYQURXR9THINlooYceGGgoLU4qWfu5o6y5AuDOWJx7xVR/A00LPrc1dj0+Bik8QZbcO3PhE9VUTgYXPT1wz04AD9c7YVn5I/aOXYQu7697OJ0WgqQevm2V3ol8bmq/pqV/e9sAgqSzq4uzeymalrlqyc6wGWramjs1Myw0VLUwoKGauyZhH0kUHjZlpEuZB4UJ6hwW6MKmGbFWTrC12n+SC2UYDKwxtSNGCZp2xtVKrp1OXxhvGl5PTDImn3s10Aeeg9SFYhdn46CKcheqpdQo/cdWN6PUbl8BT+7Vc41tfjMtgafbOFvl6SnmPjyaEVp69Rd/8EvLtF4Mm0jRH3VgmtJhPL0zYFrpZ1ZinKSl8zS7MDrooRaop2aK21rdWSuBx7KrrGqiz7lYA40CaHz0Ub7GLv/ju6R5kFEXFemwpVm0KcWDy1AO9dlikvmAXIMUqTi3N6g3YdkideAHfHsmKnnwFKYZLs2hVHpETO2EfO3cSAhDF92Eer6xsPfZdODYRMIjaHBD0eV8sb60lgkRt1x60lpa40SCqpgYCd7g3u0CsuhAKCZK0ys6rLe5aiOHGDd2mgzlagi1AngROpuAdHcU6RnTjGlttEu2qGGWzwFm0ii9UCsyr0oOVjVa4DCQ5g1J1grllRdJc8lwwdjJtHSYtj5at7KzoyZOwHKZWZosRHxaWGK2oaSOAFrl+CFcIhEI5tvpM0NW4d7b4/k6g0BPpxoKVRVy00nu/xL218LpZC/ldZ2WVC3PgWiuwRZkf+2l0QEvLtpZgHCTNbSRmJ5NqPaFaq8NTE6rCEbhYMh3+9vIlueZk5ndyYPn57Zcutn33cKt69sPcAp+DuvgUHJtPDYlq0jZ5UAQ7Un/aNyMSNO1I+DSTpA8TUZh9mM1ml1WfkqIldRHQh6jMq7Ih9fB6z6gpD/U4uxxnQ9leWOt7Z22AB30O5svLmwFzoPz9Jzf7sInqpGqTshhdtoyiMs+DAo8y06Pl7Ol8z3ZU/WFl2A6Y6+rDvaVq6+3npg12SbEbPYkwehLhrZaUtfX5hrTRTdmE+4TitwttdWGpjv0smgqUe2MNnAdo3X2O27ZqPt3cHKqIjHgsSMJkLPHTyXgWChEezfpT/aGfHK5fy379LPs123gd5EFfFsGxuY7K/OblGx3f4uurgeu2zOm3X/T4j6xMk/+8PASUlkeCH3CZB0nRcJ+5/+DetSTIry8Ur8t69+5fuXfxPrwOa3J8O34s64zUX09xTydEAfeZe/dtrqNgFNXtdUXyd1dP3J0J/s38/Zfx8UbTeVkkbR19W5U/cTqb5s5vxe3rgEGTeyxrbp0HO8LJ7BhSc0nBzV37+nmXUkbNJ+4JKPlwxmDn4X83uIz2OSnagdx57Dpuc3r1TGARkyjjyIHUHSfxXEOissANFxSYo+WOa0uu6Rpa7p6ObEjL4YDkZcFJ/Isxtvi88jfac6ZyLogi0jTcIQm4pom5dl8UhA6ECeHamHD5k+RNScnLc5hYmKvKuuXEj4LImLrMsr99Q7gA45oRp2UU0Lhs2hfzwfl0nCfFp+GI3xhDpE4eO66Ng5Y7kj/WhCvKliNBmxQ7tu/MFsnLuuPKYnhKiqYNiuiZv8VKXdxewgP3nsWH56OTx6e9+4bZ7t+4D5P/8YIxZtUJF3URJc2L4TYmBUdOJOJu9k19M4h0EybFTVX2ZR2W7UNASf1CCrVo9vVZhXVZtsNLnE3XtCTnkqb4Y8s97il9za+2vlMvPA9b7ufOirt5yXlTBRF5Zvwj/zXjbZK/4vuYtHFScMJ/sUhvXetvFO85p1SkbpKGedtF2kNQ39Ak/F5E/gfQwtknLx6SPHJHwkVBwdUkiGIuwsX1b+/r/RYJgOGo/5zHQYdJ8S+fOJdwx4RSLqDHoGu4HWm5gBvzEheTmnAhiQLmP+UjF9GE6SYiddu81iYDNVfHhD5EuODctbPi5opiqbb9homXmnsMEkpeummVFLu/Qxk/JMkiwngsvRyqy7aMSnoOhS8mmjZo9yzaj3npjbm4pqFcORQBDfcLt5gvVMtZa+vF3FEZki5xu46b/CYKbs7yjvakYuGd+/XvEuo5I/yu8F+niH8aloZBEz8b3SYF5oY9DcPLE5nr11nljw1HikNSlwXLBdwhqJMgpKThgppwTymC4AEan563/s1J5ScVoLVlAF0FzhOYTahC9VUx82VP9m+Lkpc12k3CEt4oPCe80ZNIo0vJdaGrq7Y9X6qf3/3f//2//g/3XjfA2nlQkQqcwT8vA7ZqofVCZTH8MjJgOmifHpW5oz69X2upNrxzPr//5+DYcM2XhmtIgUc5aYYoMBoNjI/2NeXeP0vFjZ4WjMISd9y79xfG3v3LhSqJ4pJ7f6Z9dVXviyjH59dqozgvMffz6a/AzHkp/4Hn35YSI+4cEqOWcqRgVuVGo6I8npPqD34K8Le81H8aNTGh9Fwyf++t/hfoZLl7RPYlVyUVYd571ZT7OiLffof46iduSdpXSZZbK9dXa2A7c7BQH9bK5/f/HDHFj+6aAZafbm6E6exanIyvL//e0KAlTXuTkzYY4aANbp5ojRL8L+yMedOQnOmHlQlFkJPrKw3e3T2X9p/fvf/l29X+r6P3v7xg5td3jNx9nRQtV+7PjBfk+ILuYPN3NmmHeuKSs56mmZ++/+XV0b9eDyTtixbebLi+evofM3JD2tEzqfevyPz3sPZFOecOLGQKerZ6W3LWCpyVYZEdy9r1a1wMYZutuXrjNIPPvmqDWMobnYdGh4DuCfc/mb88DSWYe//L73WXv3J/4dIv3Kjm3l3bwz67rZNi9477t7N0LxvJh8vBD5dG8jptyuLqafuPVr77K4lxf+EGjdc5N3r8axm4+laze/nxDzcaBfu2/O8EHIVUtOwYbDLSnfsUVrokj0nEIsAZPOdFL8tIbjF/ue76KgwaMh1zI8yNuD//+c/c+1/e/HLgV+7fuPe/vGzkf33R3b055blI/Z0zXr2y+s0TLoR+75yMdP8fPkAKXJVJ0Z6z2S8/uoT49Rtu8807oN/1lVe3PK+d4+XUu++tPqP/WaE/0B1TDtPdCz/5xuH/KKC/UmX7wXYMi9UzN5gcbopDToRCuLKduaOer5C+27S8STb76jeMNG1ZBzvyW3LZV09jrCJ6vuC5Sh65f+J2NakYFp7O/JW7qeqS1Rr7om3+NNS4Vy96NFW2uaQZmrCOFasFiVgN+ZjUzVB/sjLMWeuqxSUF9wt/fS3x/K9/4nB59dRjtawOeyH88xnsL6xJcL4EfEzOvwSkhFSccMVxuCzI1dVvjVLyyG01+3V/yAW0JgHuuDzAQ88+yHh6bB6S4rH83rF59thcnx6bV/NXAwvDeXqQfaMxZYIQDic1iVrW9bP+P2mapBguTfIMJzU3eq3bM7k5xiznDSXdY9MG4RDOBoWznWfLvv/lBS+/vrYQYxWTx2BP24bjOf4d9xeuJYQbBS+IMh4YyddCDQxYhMHRVu+SYn86dxyncxdYE4YUEpUFN7IOz03zeRvD0gttV6Qe5C2LYWsUl0e2i3t4q6lPX418Qykv72aGauiC2KThjnXSshL3iuPach/Fr3bfXFd1eUgYG0mxe4gYNJggQwz43YWPyT9MPPhrqqdveTupD0n0lAHnON037W+zbcnR4RaEeX7AFWXBGqoCB/Xlgm3Qd9JwdLhOSzJCO7YpJFc/cU0UFAXBAzqrugwJvr76iXMMxXh94VAQtuh83ccAVCfRubm+3KEVpD2WdcZRciCUdWFNmTP6Qy76Vy7ct9yRNaTFH1suDg6ES1quTnZxyxXl8frq2ZMGbJ/Bhy//fhUYR0GVXDdllJH2Gt9cMa/427eVB1LXCSbXUVk8sjw2ROc9pdyf/8yphnb1H/aw9D+v7gbl2m1Ngvzz66fZxw/TK7b4t07tfIE6qgktA3zuJkjFmvG37PyRKTIvW8Kdb6WfrTzY4sxnc/2Cch402TOV855/F64vu66+0ys+rT8fddl20cLv7fmG4r7ypNHoD1f/LwAA//8tm7A03z4AAA==" -> "H4sIAAAAAAAA/9R72XLbzL3nPavyDjj6PJVz6juUsJC06cSpQxAAFxENYWsQyKRUWFrE0kDDALgAX/wiczO383jzCFMNUrIk23KSOReJq1gyevn3f/n9tyY4J0WDimZotSX6yOR73CSlXzU3eXJC0R+YgOyLyK/aT1fqSpVFzQbSzHCvBvRpCFFVJ6T4yHDX7O8GvxsMh88X/W7wSFtK6pLUSdOv9ZvGD+McFc0fmIcEo8LP0aerpEia6/Bhd/V1l1X5Rf2AqqFchCRKit1H5n2QNM8W9Cw36NTchJjso2FIiodk97uBmuToG+Z+eb5mMNjXqKo/DhhmyFAOPjIo5Id0cMAwDFPX8b2/b2JSJR2K7jPU9mvpvyFzVdfxsKp9ZjabzUQBdP6ca0Nepo/STJ+Js9lsPtPnp/RBWa3w4mFeTJMQL9vcqWSxsmwebyZNZi4sDpXvo/ldd+RSd+IUsY7vtmqJ7qoEnMAWLz6Ejja9MZRSjNhuqhxB+2v2sIunD/sWuKPp6lfVn2itBcXdOAZEOT0Y28U4WTbhjanjIpCV5LY0sxFOSjLSvUZs8t3s8y4zZxOpi9tdMNmP1WlyslankSOme1NlF1u9A2mJHtrE2f9ar4xfY96u9Ox2Ju73K1cPqhT/qsQw9zeH6tBaGr+vteZQuGIaB3fHVnvPO3epX95GN9PY8j/fydxRaSe2whfbcHS3O7K7RA8mdRIoVvceWOjkCGN9+uFzqWuO6t6G5c6rsOkvl7eeqcZNp71XI6/SNoq9JSY3Q7N2tIubEFSaaOFgbB7u3gtdx34WDYUP59pIY4/l+Hj8fBcfjnzRBEJpbe6aCDXrX+GY1e+Ksti2pll4Jd8pxxDxXLA9Td4X8RQX8abydil6HxK9uJspp5sQCxPZXLe7ZH8XisdfM+6Du8euurU/+2KTHdebzEilMrW2PBqra25CpPf1ehmObpxx1j5sDpFawzj6zM23ywWEWtmRXcBOx9BNWGOrlIVn3HAI7uY3xq8ObBv3wf3AVg9QC6MZ4RfeQ7Eed65hb9frqeplfnE6CfJ7W0syeQ2mtZ3yLNtN5m3Lrh5Wn61gzYnjh/cPkeCHRrUZSaFrR8rqhhNb4EwULn0feslsoa1vQdBtFdYSmocPJxZx+qdPTO6npPqvCkWx31yHJL96iXcU8eMxN+0xPz9jHnvSigOWPKZjqzuRSxU8KieKJSanpTU5atlk+6FIb7z3iNwBXb5R2ePt6MP4liHBPvKTF4cNjlXSoHsaES5uWfpN/JG5afLy7N73NEbcH/yq7jkLz1HgI/PXC6OaKdqrjXQ/11R1ZX36IIT+wweWRWN+zI+CETd6eP8wDh7GPmIjIZxyfPhhyk35y+65pt5ppmw8bn//MEbCJIqmow/cmH3ww1HAChNhEk4iYRoE7yeIRx+46OH14bP7uWxYnzYm22xMbm7Y0dpKRMmAa9u0vbXOKrbRz7HNPOPWpm3IUAaS7nhbj1UE016LHouhLQFd5d0OQHFhZ2Mu4D0W5erYkjLeWMR2wBtixBqGY5ebgCvX/tJLrUwxDPt4q2NFjFjvswEh0DO81C0FGrYiROwpUdlx6SlRHXKlBLZeGjhAMBdxamXcZ30b3UEZTixoeMjmZGiBrb8AmrUtxehY0rnRi7lM2VpwbUQsLBzbcGyoyIassFGutmaqxFCIK2vBjhEsJzoLRJvFgqEonpk1ByfDJMqBNu95Xs9tW5E9PlJsWZH7tc5Uos96pgC9ECsHKq4Jgep28cZxSmBDXKBCNDQbiCq33qh5tDIk8eRulS5Kd7cuXKcwU3mA1bGXxSfDtk++fYKO/EFQpbWBUtj5fElUoTxZS7y001iwsXvY8GCtOqtTmIoQwdJy2ZOvcqEAYdnqR8ICychdgXTWFo8CBUwgBz2bEws9wxt/EYnaUmlCXJqqM81dx2jREprWvOmCzJNNpxmpQli5nXLrQbhXc1CrSlTOMWQdab00OE8ycAQsXjl4mVE5CpSMAm7MZXRrO9HCWhqdKQPfcUAe4cgxldIH2WgUsdFRxYrvWKux28VcsBU/q3B2a8te7cjqyFsoviVzsaPgxLBEYG4NR5XByixEwWDx0S3wPoDYDuZNZxSQDyTjABdci5bkgLbxJJQNHmbcXZgp60AvRwFfCyGGDVzCzFhAxebWc4uPRNVuONfmTLiEsbkVjaBbZ4HgnW672cnI3U63Ry20gRixUNQdRYMytzC20cqGWJ5jz1Tl6VzHWDEyIniW56pCdvQW0zo0p7cu9ko3w2XEG3ubm1Ug4+aaHIkqhJm5jQzH5uaurSzMNMIA7zpkiVnAH29/sFd83GtsI0VPpoJte0C3ubnuuKPv+9XpCaP6rhSNouQBj7HJhuNAKTdhtmoth/N9WTmZMlaRc4otATuhFQpGh+cWXNtGAY5OYbPqciUYnCG4rEGifMcZNjiYipLM81MVWaIL7KnrsQbvLME8XEwX5nLNq3JzZzonC3DwVt26R7CoDybGhbMMq2BR2nCpHrRteQzS2IT5qQmX9sFguTvLsm9tZ720543mp9APO5gbrLf15ZFgWSvOdhqoSevbYBljM1NqexuvdP4k2Qs4sjMAXEsZg+1MgItxoUnixsQRi6Coa3rJ2nwE9GImAAhNz/nAAtse2XLZmsWs85f4AJT1SINrw+CbFjnANLdRrmcx7wsxMHNvH/Kq4JhTHjiYM9K4QTI3maeAdTMyvmXLsWErnLkkJzeLuNAG7q2g3NrQsKP51Ag6t42yaOva2djmvI2L1ZELY1Xv1hoolNR31qcwtUdeashmpt+aBagt84MQLsE4TJUD2Bqsm633AGecvlWn8+Qckw17LK9koNjYWBsZlnRoKOdYzt5+kylooNd52EYLnPsOiKOFPZkns91qLsru1oi1Hdmt5rPzR/FwWIAy4EeTlaTubiVxpCbZ7dP8XLS87bp0nePOKmDj5rB9sf/84VWJjDSLjNyOHNWuxMAqc9CVGegIq0ll5nbkpHaE8yTSuRY5uikZg/65zDyrjD2LnEBKTppVJuAFf6D0+HEcLWHrmaIYLKJDmGPWX7CT1RIQ11pxAEdltIhNm1WUIAct2oqs70z3Z5nPH3MLusiBrZaIkpVyh5Bfc75zyjb5tPWOL/QRBwuc+Vtj/Hx//5HHh2guzj3HO4S5PVnJZRwks5NKPxJpgUVabT5rVWl1WskRgLPXehK1QNB3uuOx3na10xLx1nVGO9Wa0c9ETe2Jmu52ajrrVFNcWlB/YYfIWX/2HMBqiYgDRykDWcm85RqHgjoNBJBEDq69BWxDVmw9xyDuVt+7/LR5LoctwMTPYRrNRT1y1rXvqDuTh+OVjPde/mHyjcyKyLn5qXRbceNts53unIpAWFN9N1oitiH/Y50/4920WXlnL2ESLHC6sRuMLLK7lVZHIO12bo7ZW/0bTPUfy5lmkXPiwo7cfm/+8jmqUpmDtMw8qUypLTSrjIFFEyMZaxLh1JSwICW0icCaVaZqSqjNOjV9i66IQUrpknFv35SwnlTmnkUE1SKd2xHeTcsEWKSjmPcsSp9wrlWmnvUmv2OP8tXTKRPXIq3bEYH6ipoSnu5XJXKifF9oUd869ny/Tbf1JMKDjgiqVKaUrkd10JUJHQNSmbtUL1SOtMxVibBuSnjVItzbdMXctXp+eE/q/ZTqotXoGSnpKH9erx/KX5lQPl2r93PWk97kl9JiVavM1Y4m1zJX0zKjfNIxIJHWTWlsoDGCjF2rxNTONJ78xG6x21EapNMsynOZu10fm3gg9frFbkpGatfLIbjW2aZe2uv5LX7ZPj51FE8lVjty8qh9zpg7Ur69lHDaWa+tavUxgfMscgRv41eg2HS7Xq6jJlHaZe6mPc5OFxpj1aK2LWOKG4ozj+L5TboiViXCX3xh5EllDKQSg46MvLNuxl5K8Vdit+tp8SrFc0rlelsP5xheYso31SO1t3f2L8rfCFziPJAIB1IyojKAtNf/W3R7zKi9LsiJ6sNLy1jtz+ltyFLZXYoZOk7XWuRIfekndHt9UX1qEsVnL5+gnn3wSO2jSWREsaz2cz0eOiCVsfu23VjPoj5KWjWlvtBjY6RJ9Lk/q9e1RnFNbUr1Qv0uJaef2C3XepzS2FUmbkdxTzoagyiOe9z12Dj7eO8zFG/UL9724wSc/b7teZHO9gMpOapWGat9bCsz6otu2ufsI/UPVfpZfJh1mtTHyBH1A5fGK+lcA2gStWOP42OPN4tw2jn/0xgVe2/68YzGvwQcv58bjG18DPgxDgp9spJcDliqsJrvjkiSj6o0O73IKcqOUyXMq62I0dLAQV/zjLtvaxnRBdZsHKXqTs+VjuZHnZ/uQ8FoXQfvo6U6WS1A62+N0uWV+gf5TtKtcqHbJ8v4Jq99pf8sF/e51XQoX0bp5RiHKdl9n/aMB1IpGn08LheGVcqGVc5Vq5Qp5gypVGjeoOO6Vc61c26aU/wAypNFeCMtFSMtRdUqJeMt+beQ9RdTKut4JTcYmeLaW8D9ua6ktdTs+7ZbNBg5ONNSrGiZoWiZPdbSSNYyt9Uy/aRlhqilK07LlHk/lsK5ltq8lq54LVNHWhrPtXQmaKkraKk+0jJvoWVr8Qe6lv3tWnMdDmvJ9O3a7tkn5GHrO0qtpWChpWGnZfSsaKGlkaKlxkJLZU5L5U5LPUXL5JOWefN+Xb9Wb7XMk7XMHmkp5dfuzmv04/wNffZ1lgI714mwlohpX8c6IA6+qRMv+F7gwt8acTAXLd+J9u7W4MLcri+2oHVXGS5iHOYc9YFvbOFI9lHbut1KhqNoAffeAmaXvTDklcKzfoQx0bYUdQd5mKwUgMPCw2EiitHWIJ4zZs89BT4Eb8j6DNtisDRwmI/pHt4zxYutfoAd2dDsrkwDnjsGAsBhMn5pz/a4M+SxpRWApXrc5OAQbMUDtecmn3ZuActgoe8DYV1s5qJsYXXibqPurXWX3ui5jl/XuZ2/kFtgeVt/axAbA9FwxmlY4OO3ehBjrfc1MlZpL5T2eSzta5tzDUdzBM2Dp8c6ksZdWi/QPN3XPVZfU77Qj8urE22xmnipPAHdbAJ4e+JZs4nnyBMvtydgsZqoVjZR02ziSfLEteyJJ7kTN5cnqrSbeAt7oln6y/p+AbGW7ih+Wy1fx1rupVoq5lq6G2vpjPplpqXZ8bwG5lq+zrTUHWk5jLXcbrWUrg9f9YMizUFjmjv6Xo/WhzRvUZkkWiv1tUyfv2mdCM61w9ij+UIirUfr0bSvb17IrznqxEv1CbDUidvpE9fa9bpQc3fiOfZE7aic9sTl7YlGny15okn2RJXCiduF/ZiXzl7KL81YLY0zLVdZLVdyLddZLZV5LddHWrrqtFTMtNxmtdw9aelqpKUhr6W7TktlVktdvt+X6qdXOWRMa09P6vteWj90ff9r9c+07qQ5PQV9zi7jc/4mPO2N3ZQcPdprdGWivapnVMuegNSdaJY6AVQPvYxULmp3fQK61cTlqcyrCbDCCZAoVnYT13Inbq83Kr/7yv5KquVKoqXuuI9haTbW0nWu5fZRy+Wjlrqslq6orJ2W7jgtl1sttU9aauRaOhv187nMvbY/kMpEPdepp75Wps8pzf29HgT1fBfAqhcfoDUe1VePC6mvK2ld8xL/VjhRu9lEpfLx9kR19IlKsb2gPXM4cVN34uVyrweV+oqk93gHHcVNNgE5xcjqlf13vJZGqZYqiZYbWEtDVksVrOVqp6XqUUtBouUuf84DYaulq1ZLKWZWnJaKqZZi3O99aX/ax1A/TtWur4e4Hg9W7/Mj0JXZpR/l+v6U+gCVuyuTvr7vx2jN/lJ+6uNe7k7AQp94kj4BktrLplI/yO2Jm64mak7H5d72NF540qzHB7BWE8/6nv+DWEvD8RnTs+PjZZOewaVpj3Y6C00o44VpAxHKdj+30Utg2lhGTinprNKafCRGLJ7rTrSGEK8DmxNvuV2nWuJnl7VPquRJwDEyVZBZyEaJs41kG+Jbk5/6phPzLjsWbRuq82xt6Nto4WcQWvZ6bbDyCdpQjIRIdVOg+Y6xDZbA1zvIuzyXRmxMXHYM/AwKFjQUZHO2vsUalDMW8v0XBxNjG97SuYh9PleKgc1Z9jZae9wrPpxmbuSx8/yLAgfHtwgrKzM/+QYfE09WOX9H8SwKHh8pvs2JqhxJtqAsbRYnKmsYhr0WbQhF3TLWemYI+jYqPBZudGe61jPFMKRV57LKMVSg5UBYOdaKd1lszDOOc9N1pXOltuHHiraQBbglgo/LGBWz1slBEgggU+XyFLFr4m7Lg8+Wgt0pe5flDhFcCZ40q0JY6poMWV+BecBlty5ee4HdgLBtPtv8eh454ACwYTrZaqR20ViF4kqVax7wsIlsnVWXygTJ063axZ8Nbn0CqQECB/LAnJbQYTu4hcDTy4nLKsqmU4glYwvmcK5y2UhdRJ/9pO4M6Lmh7O1DGPteNqr0Qjw61roCls4CZySEBdDUrG7NRXOwJPjZ2io6ypXjPI/lgIVOwHlbJzOOOifOUe4dImc1srmY1fkpNOxxbSpl4tmnynPArc9OJXMLRubSZdXlWgGOsg4Fu/NtcAskmw2K8BYoOEG2e/CXSmMty8KywdiQd50pN+tIwYW6WCcRiz244DSPjYqNYGigA6JTRBAusOGxysm0YO7xILUdDkNOYaNj2apbudOdCOiZIhp8WXhpLHi8J0SsIfZfPqWirUNltWHXormNRENWMj2PNJjFBpDhwuMU6GQ165hTFhS7Y5CCwxzHbGhBAFj5dMuzhyifptoygjbEMsSro5+tlUCILNNWYFDoQrjwcktZtT6MWm1xYiFbdr59mqu5sd500cmXo5MNs1vLXntI9mQdgrnHjh09U4Blq622Lb0Ae0c3i4zIWXVmPi58RT647TTb8F6lKZ6iph657YCGUpFX+emdkU2JKhuidSx7WqYij/RMyTUZznWbk/RcESMWChcd1HqmCBELCsfGm4jDcx0r0JQVwdhGzqNcdrZWwDKyTRvDOc5abWukRocnDo7XlC8rxxnkT52TqVyUg8azwTLIRkcHRlkgnxqr8BJHXvNut3aQfWq+lWt06/Ex8Rd6Z22hp6aYddlwjHDpmlv43S8hX38xqENFseS1odsG9em5bjeFqpdVxOIUFZ5iFnprOzCFsi6YvLJSt0aK7OPIkVcVkKftLQdGvjA7ujDeRk702XNOdyDDMCxWI0MyKp2LfZ3FLuiUwzz1OLMAaSRHqaEYnWY3LZTHrs82R7TEJ0+CkubgLFySI7RiK+hiayNAYMP4LsjjpZGtRp5jj3QINCTXB2h7rMeTW2MBbSQ3K9c2Fga/VmxYTjQINlGntz5ftoHNJVBQSjMvt1Hb2JG9dgKnbu0cLsAWQFcAJ51zj5ZkHEO8drStMg53ZQyzqW/NG8njSsnOS+LapQmXEfEFMbOF8mTnhhEKM8F1wMjKlFWQNCxcNKK1xCdXiMQgNTKTD9mgMPhwiXUTAjjP1UOwhCDgyMjoMk6V487aRncbDtsuj9eGXRrIgUu180jUGXO3nTY2u2uNrHTsHDjGEmxh5sVeGh7gwjCNBRj5SX0b8tlJx0qHsNKo9qkOZO4InEjQLfb28iW5YmX6D3Ig+fT6SxfT3Nzfyq55PzPAJ78qPvrH+mONwgo1de4X/g5VH/f1EPl1M+Q+TgXh/Zjnpu+n0+ll1cekaFBV+Pg+JHlJalT1r/cMa3KoRtnlONMWzbmxurNWGrhXZ2C2uLwZMAPSP35yvQ/qsErKJiHF8LJlGJI894tomOkuJtPH813TktX7pWZaYKbK93eGrKy2n+rG3yXFbvgowvBRhNdaklbGpxvUhDekDvYJjl4vNOW5IVvmk2gykO60FbDubWPzKW6asv54c3MoQzRkI07gxiOBnYxH04ALo+G0O1Xvu/Hh+qXs10+yX9ON137ud6Twj/V1SPKbRwY3mi05M2u+vN9oC/OtcznEClzgj1lB8AM2HA/R58OOnA78NSa7+qenPb0/8j0tfDNw3ZAcf/+1kj9nJE3+cnnwMSZHFN1HJPeTomY+MX9mrhrk59cXitek2l39J3MV74ProELH1+NHUmWo+naKeTwh9JlPzNX3uQ79YVg11yXKrwaP3J0J/t38/bfx8UrTOSmSpgq/r8pfGJVOM+d38PaVTx2BeSAVs8r9HWJEegyqmKRgZo55/bRLImH9kXmER96f0du5/99NRMJ9joqmJ3ceu46bHA+eCMxjFGYMOqCqZQSWqVFIiqhm/CJiMNkxDWHqtsZk93hkjRom8lFOCkZgn43RxeeVX2nPqMoZPwxRXTOHxGfqOmaafVEg3BNGiGlixOSPktcEo+fnULEipiRVw/AfOJ4ydZml//Y1YvwoqihxTEIfx6Runs3759OjPCk+9kd8ZQyiKnlomSb2G+aIfl8hpiANg/wmKXZ035ktlJOqZUjRPyVF3fhF+MTffCnPby/BiHlHo9HT0cnD4959TW33J+b9+H88Y4xadcyEbYhR/Wy4iVHBoBMKmZt9Xd30It0ESXFTko5UAWnufYyqZ1LIRb2vziqsCGn6V0brtm5QziR18fuGedhj/JJfZbWRLzz3W+5m1pK5ec55XfohemL8A/st402Sv+D7mDRxUjDcf7NIr13r7xTvKYOVqKqTmnrbRdqDX93gJPhR/P8n0MLZJy8ekjwwR8SEfsFUyA9jJoyK669vB36NBECz5H/PY7+NUPEfHxkHMccEY8bHR7+tmR1qGJ8ZsQITowoxAQp96j/kgQlxQnUToqqpX2qTgpqpYoTvw6hgnJW1ZGaSZMim+YqJ55p78BOMnrtpmRS7f0AZb5KkEWE0Ep4PVaQhIcHnUPhsom78Zk+j/YgVXpmLqWvMkL7kqJnfmPlsLhvWSlnNZ5ZMkXSJ21Vc5zehf3OWd7hHJQ3vzJd/SKinjPBT4b9NEf/WLw38On4yuomKiOn31BQvj2SuX2aV39cMKg5JRQqaC5iDXyV+gFHN+BViHlMEinpofHza+ncnlV9kAFeGBlQZWI9g1m3Zll+UMJ/3aP+6KHleEd4kNOENg3PCGz6KNLwUeBe6qmyas4X86er//u//9X+Yd6oGVta9DGVg9f55GTBlA67mMo3hl5Ee037z+CjNLPnxbV5DNu2N9endv/vHmqk/10yNimiYo7qPAsNhz/hwX2Hm3ZNUzPBxwTAgUctcvbswdvUfF6oojAnz7kx7MKj2RZhH55d4wzgnEfPr6W/AzHkp+55lX5cSQ+YcEsMGM6igVmWGw4Icz0n1jR8e/D0/ITgN6xhhfC7Qf/QbgmfopLl7iPaEKZMSUe8d1GRfhej7bywPfmEWqHmRZJmVdD1YAdOagbl8v5I+vfv3kCp+uKl7WH68ueEm02t+PLq+/L3BfoPq5iZHjT+M/Ma/eaQ1TKL/oGfM6hrlVD+0TCj8HF0PFHuzeWokPl29++37vcWX4bvfnjHz5YqSu6uSomHI/sx4gY7P6PY2vzJR09cTl5z1OE399N1vL47+ct2TNC9aeLXhevD4P2rkGjXDJ1LvXpD517D2RTnnfi+gCnqyekMYYwnOyjDQjmbt6iUu+rBN1wxeOU3vsy+aLpryhueh4cHHe8T8T+ovj0NJxLz77We97Bfmr0z6mRlWzNW12e8zmyopdlfMn87SPW9b7y8H31/a1uu0JsXgcftbK6/+RmLMX5le41XODB/+VgYG32utLz81YoZDf9+QfyXgSKjEpKWwyVB77lNo6ZI8JCGNAGfwnBc9LyOZ+ez5uutB4NdoMmKGETNk/vjHPzLvfnv1O4UvzJ+Yd789vzb48qy7e3XKU5H6kzNevCD73RMuhH52Toba/w8fQEVUkqRoztnst7euPL58x22+e+P0U195caf00jmeT139aPUZ/U8KfUN3VDlUd8/85DuH/7OAfiCL5r1paQatZ24idLgpDjniCm5gWjNLPl9Y/bBpeZVs9uVXjNQNqfwd+ppc9uXjGK2Ini54BskD82/MrkIlxcLjmV+Ym7IitNbYF039h77GHTzr0WTRZJK6b8JaWqwWKKQ15ENS1X39Scswa6XKBpMUzG/s9bXAsl/+wERk8NhjNbQOeyb80xn0X1Ah/3zl+JCcf3eIESoZbsAwESnQYPC1UUoemK1ivuwPGR9XyI9aJvejvmfvZTw91PdJ8UB+dGyePdTXp4f6xfygZ6E/T/Wz7zSmVBDEREmFwoZ2/bT/T+o6KfpLkzyLkooZvtTtmdwsimjO60u6h7rxgz6c9QqnO8+WfffbM16+vLQQZTVCD/4eNzXDMuwV81emQYgZ+s+IUh4oyZdC9QwYiMLRlDdJsT+dO47TuQusEEUKCknBDI3DU9N83kax9EzbJap6eUnRbw1jcqS7mPvXmvr4zch3lPL8bqavhi6ITWrmWCUNLXEHDNOQfRi/2H1zXVbkkFA2kmJ3H1JoUEH6GPDThQ/JP008+Fuqp6/ejsmOtkXUyanle7MfeiBe/vT3tzQG95FljzHzxz8ysqYM/nw+qL5Oyb4qfBz9ZdC0JWI+MVePI1cDdArxPkL3+yJp+jvTqwvVGlWHJERXfxkM/lwnRVZfk33zlYJ/rO975o9+E8b3mOzqq0FSlPvmcvP6dATzl8FjOqIb3/321kX4l6vBriL78r4vfz8xV99+Y3HpE68GdVMhP39rZX9deTVAF6tehyRCYS9/TYqrAVXS4Aft1VkL/6KY+Rq5zka8VE2zKN3XzdfZhjC4vzmj2cJnClLQJryI/OpyKdv7aFIzuL+CTTKEW7opQINfmDr0iwJFfUQrKxKg6HrwC2NpkvbykqpAdNH5ipgGnSoJzxcyl3vXAjVHUmUMRgeEaedek5zS7wHzn0ywb5gjoinh9w0T+wfEJA1TJbu4YQpyvB48Rd/eMc7GjC5/v0mmQ79MrmsSZqi5jm6++tPftY0cUFUlEboOSfHwXb8z+6V/GWx65Zo9TD+9fJp+eD/p8fcVfudL92GFMPGjcweKSr/6Nh/9nioyJw1izt9kPFm5t8WZz/r6GeXcr7MnKuc9/8U9OviPHOBx/fmoy7aLFn625zuK+8aThsPfDf5fAAAA//+KHcbJgUEAAA==" # forces replacement
      ~ vpc_security_group_ids       = [
          - "sg-084607083aaa39727",
          - "sg-0eb65fd8f2c17dba5",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdb" -> null
          - encrypted             = true -> null
          - iops                  = 150 -> null
          - kms_key_id            = "arn:aws:kms:us-east-1:933752197999:key/9630f91f-f3c0-42eb-b65d-3defffc79926" -> null
          - tags                  = {
              - "AppCode"      = "IMGB-001"
              - "Name"         = "🏗 Internal Composer (staging)"
              - "ServiceOwner" = "Image Builder"
            } -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-058d1cec56397f102" -> null
          - volume_size           = 50 -> null
          - volume_type           = "gp2" -> null
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }


      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0a10f4aba3ff77c20" -> (known after apply)
          ~ volume_size           = 25 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # aws_launch_template.worker_external_x86 will be updated in-place
  ~ resource "aws_launch_template" "worker_external_x86" {
      ~ default_version         = 4 -> (known after apply)
        id                      = "lt-0195b4ef20679c780"
      ~ latest_version          = 4 -> (known after apply)
        name                    = "imagebuilder_worker_external_x86_staging"
        tags                    = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🔧 External Composer Worker (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ user_data               = "H4sIAAAAAAAA/9R52XLjtp73varyDvgcf5Wkeihx0WL5xKkjSqRWUhJXUWemXCAIiRTBxSSordMvMjdzO483jzBFLW7Z3VknN/FNi8B/xw//Bd1NYopjyhiHFD+CqCA0SGFGa1Gwx94/gJsUsQezw9OdMlQkcWqqvY7m3FXKL8bCWR4k8SPgquw3lW8qDHNL9E3lKrsX5GmSB/RECymFyI9wTP8BVgHBMYzw010QB7SKVuu7z1xGBuN8hTNGilHiBfH6EbTcgN4QnEymeE9riCSFx6AkXgXrbypKEOEvjPv2lqZSKXKc5Y8VABhQWvAIMOKZcrECAAB57j/DgvpJFhyx9xziw4m2/GPAXZ77TJZD0Ol0OqKgHmGXOyBeKj97nXlH7HQ63c68u9+s5OGQ9FfduB0gMjhEdiaJmWHyZNKkod43OJy2vO7suOM2TtOO/TmZLZQUz7JA3asL0n9A9rRd0+RU9NhjW96phw/hau23V8VBdert4QcFNqcHwxLXDV9N5P1KW/QbwYCimj4nsSvJwTjVwzoJ0qQ+X1KRRuvOyzrUO83e0T+s3WbRUNrB3hju67a4KXSF7S/mR3WT4tUhsIsP+VD74PNmNg/HHbEohs7czTbkg+xbEZxss+3BmPJFPqXb2BE3vjvbHaYt3p5tYDr2am3fgC8zidvJh6Yp8/EC1WfrHbsO5m4zD1zZOLZUA+9toTFvP7yk86mtOGOUrpcZ0eFgMF7qik+P05biLbPpRDYXic51cOdQX/sUqdlUNIjb0LezlnA8si+iJvOoO61P2V3a2O1eZv52x8fUFVJjMqMepqMPVoOdz+I0Xhx0PV6m/FHeIcxz7mLfbMV+m8T+JFuuN7iFknk868j7GiJCU9JHh3VQzJC4+xByD05BHGVhvkCRhrvRJNQ2vXRjLHjcUEZcM+m18tEA1Wt2IzysJltPyS3fe+G6i0HfsqbpMVm7bLthOQGrLeQ0Xmo1Dlvrbk37YFsH6qycBzZbWVPkdRK+v1zFo8bR0czFaNRWliGM93tBapnTIJRGajs3NzzLHpvdw4EdroYvhjvixMaqtfIEiLRsUu8hx/TkYY0TD6rdlLlNCy2DTn86GqvucSGzhkBXD3sWc/OnJxDBTZL9M8OeD2kVJdHdW7xjj280uPYJ890z5smyN+RUQ2qUa8OZyG1kUk+bsiEG+4HR3E3D5uIh3tSWLZzM1LlUU9jduP7QGIPELTwYvFFW2WUBxc9lRrhcyxRS/xHUaJSer/dzmSOetzDLT5ahcxZ4BD9fDJ3qojmc9J67U0UZGk8PAoKrB5bFDb7B1906V1+1Vg131YCY9QTU5nj00Oba/IW7O1VmU13SruytVQMLTc9r1x+4BruCqO6yQlNooqYntF231cQ8fuC81XvlneeupBlPE52lE53raqY3MgKxp1kjUzeXozkrm9ppj6XdkBvppiZZktqb28vFkpUF3RyJS5ZYZk+dK7xzVC2xb4YNzuWXLI6UhtELea3vmy6viR6rabaZTlwuHcHBcmOEsqaZu/GcyKLHLl80y1LnIRnMDdnSTFnw2H2gsI10KXs54tKeulhuXFsV9L6/MULuZb7wZpZkNQ1LW2KTkyxDXcC+OjUWqejt0nKv/mYvlBeGNdI81optU7NNS5Y0SWa9SDnoG9m3BD8z+mwDW2lzzqqiyRJBk+WlHtKtHZLEi9Rp92TzqGuasrTkPdmUZOlEa7d75fc8lNV5LGa2JTu6pSrO0Z/YdqqaFolxLGpTUxUVbjRRIm+o9cS9s5CP3mY9dqzRxgoVXiVKYxn6e80099DcW7b0ICi9kYY31hHyaaII6d4YkIG58QWTONsJr44Ue7hHG9HCVmo47B4qHBIsKz3Mdwmr9rTIEZKjsSB1V1abFmctTU6M5yGZwL4nTgcyRSTVFbsdObZ2wANLN7r06IZLSbdpXRFQ5hzl8dKyCiVSc0X20i6xWLs3GmjcsqcRTzV4ebsMtcyWrZ4WWxN94I1N2+sbA+2oSyq0bTXyiGfrcgrVsF73WG+nEBnaxrDhHH3OXYgvitUZm9IytyWlvuzL0JA435ZJoBmiqi80W5HUoR6LgsaSnROTwrWI6XbpUYst3u1pW6vPHfAg2eKF30SSxlshN0OhPHLnad3lcwERi1oDK9T6lmxyo67Be6JiUs4xOd0aWL6+EDX3OApdYbkfHzt7LXKOc7N+sExV9FhLnNvy1JK4vrbwhqZFpC5Z6orU7s4JkbUwEZbG0lGEcLfst3Okt8cOWaZOSFKP1wqT62RqyHWnkicqlhXqC0+zTa7rmHJf33hEJesjNsTQ5XfjX+AVr7zawpPnQVswzaU6N7nu3HbqX79X+1eMztepqMUpr/KE6CxquHI6QeHwYNgchJK81yWiYHvvGwKxkYEE7Ui6hjUytVjd2bHJKoOhoHGa4LBa4kVrTjPVrS7LQTfaZ54hOqrZdpasxtsDtYv67b4+GPGKRGe6vTdUzhorC2en9vOtTkhsD1Dm9lPTGijb6SLduRtft6I9RQNzq7HczDDMsWmPBmaXTuHGguhoRRq7XECpLhjGkDNtak17o7E78Ikeyrm58Idzft8z+1bdDFXVMeSGuugIVr8RT3viRCceiy1xPp2nrMl76jzuCKpl6Uv7gVVNs25K6UGPO0c4IFtVHtWn1kjTeHrAtqrrCy+ahz4PBV/Vo2WBeEWw9Tav2oTTNj7FEtfsblTWCZPGmE0bmilz+iDZO6HHIVN1xoI8Ni3N9LptzT06By/0Fo4ZNkxuOXGIUncsX5kfR1M1ljfQHu3RxqwvN5qkh/OxHqu5oT8IaKA20EbeqguNdcJRoZKQmy+Udjc452TNbEhDSZVNoo20kPTmliafczk7fl8pBlPdeIK7vCxgaZLjrJrkbhEQr5pk6/fEnV5Pk3T9iWvxVYGrNutVjrvQ2FNtLGnPuj55HkuO/tzR1CeYxY9wlz/mGGWY5hGM4Rpnj0XOYJhThntsC0KrwXPtVrvdvlA9uhnenXpVpiWbGJOLfN0U9a42nBnDqfqsdNRO/1LmOmrvzyvLCzdHWZCWXT1zYWFQEkUw9phw7pCkfdXv6IaknMKldhTpeaZJ8nDxlFO4DuI1g/cUZzEkzC7Jwkv/fRO43lB7qmGKapfgMtdoX6VLXU0y9FfHJLU3mw5V49nUJk8+pWn+WKu99az66lkVRvCYxJdDrN32HV9T+cVClSYR+Xo78q8w2QT/cfmAhCQ77D17SQSDOAdP4F/gjmIY3ULm7t/AnV+41fIY36+fY/PlFrhqQBA8gbuvW40ggzJaTXHZZ12sOwv8w/b9ZXa8i3SUxAHN0NdD+S1Qym1wnt2KDJaYA6skA8MIrjEQSzU4A0EMOrZefeXqJSh/BFcMRCcdp3M+/ap5CSrKOfQk7rxW9WlEKq8Cuj5GIcBbnB2AwIIcoyT2cgBjD5BkDWgC8kNOkvVVZY4p8CCOkhgI7M1aSXym/Cy7U4YcQIRwnoNtAMuZE9AijjE5CcYYUB+D6Op5nhB8q6d0ywNpklHAP3B8adRlt/wrcgyg52WlcJIgSPwkpzf78Kzdi4L48aTis2EWzoLVAVAfUrDD32UYxAkFGNIgXpd8Z7NwlGQHkMSnryDOKYzRq33dgdQdX+49uC8v/qvqYHXlLfLy7H4Crcb/vzGsPNUGQAdEcH6zTH0cA7zHCNSKPKudXKq5QVxLk2OSuQl9hgRnN15IcV5k5xBmSUJPTw35Iac4AkEef0fBqiDkrb3ycCJdbD6xzDrGANRuLc9TiPCr4Q/sl4bTIHpj9y6gfhAD7q9w6YzGCzaCFdhhgGAMMgyRD5AXVz/PU5/vgDo1pO8jHx48HP/wCGwMdgEhAJIdPORgjSmAoM4KwMcZBi5GsEROsgKIBDimAOGM5m/DVB4nyHxMnpEXA3toDMCluL0z4jZyKxgQfAvQNIjXfyIYvyqyvAv1unC7lCU0QQk5J4GbjZxCWpR5rs4K744L5DkByamu5eAj6HbKgW4oD7sdQyohcslYmZ9HNQRrZ3+ZAqdlYgOf/pRTr7nwN53/Mjn+vxOpC3P/9dB1HHvgxJOXeLmKqb7Np9/lAMfbIEviMguCLcwC6BKcA5hhcE2O2DtB4/GV9Q+n028l1RpqU1WRVOMK5rkpmdKbCv1S4AK/K8e3bUctKFM9455TPXN1ibl0ERe5iqTrnb70dPc///Wf/w3ulak6NJ7LAds43c/Lgi5p1rArldnrsnLCNKTXz17HkK7vH5qkmxPj6f57uMtB/pKDHMceE+H8lAUY5mQ4U2QE3L96BZgrAeMm3gHc3V8Mu/vhIhUjPwH3Z9mVSlbEKPLOzx7IjxIPfNj/DsycSdkWy74vogw45zpECcBxeaqAYeJkdy4nv/JU+0ceXfdM7mNCzl3gL7263qCzrFoMLhKQBikub28lT4oM4a+/8VS+BX1M35QXMOxVK0NVNzpqV3oe9p7uv0dl4JlJfoLlY63GNdtVvlGvXv6tEUhxTmsRppDxIIW1qywm8H4odXTyHEdlfMoCGcMIVyuyOZm8dqtPd/cfv97AfmLuP94Y8+muFDfLgpiCpDgbHuPdjdzTmd/pmJ4q6aUYXbfLe3r/8Y3qT9WTSP0ShXcM1cr1V3nIOabMq6j7N2L+Hqd9Cc55qHDLAL2eOk2ANlDPwdDwOsgpzt7i4pS2S5rKu0tzurNvev+y5DHnJWYLSYHBv5f35boUeOD+428NTJ/Az2DzApgM3FX1E59OsyBe34Gfzt7dzkbPF8XPl9mousmTuHJl/zXKu98pDPwMThHPIsCsfq8Bla/Nb5f/nAEMAwua/J2A08MpSQ6gHH5Pmf48p+Rn0Fw2S8hcZxHQ7Zx6m2AVIEhxteLCHDfrgPEAA3788Udw//Hdk+4n8BO4/3g7ln66GWh+SU2ID6dx4Y2uvwSkX3k1+E1cnqNyeiJ4C8PPG3dfpzxj7DVCX4bizMCE+HAKxzvBKKP/R8HXON+A/Atv/n54PZXtMm9/BbVl3i/SG5LKt8CY9qZvu/kYY6/MkCiJtzgrK0Vw6vl6qg7K4peBXdmF7jAgsIiRX60gSE8Iv7uJ9KWB/3Qb/bJ+fLoDP/10a8LfKMTXQlukl7iCHGfbAOFLfGcZTstO9/0zxXc5yHCUUPye7XSR8wSFuByJfqHBuko7i7i8af3zfVgfH1os+0UwGeabyv8GAAD//6S7krOQHwAA" -> (known after apply)
        # (8 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_launch_template.worker_internal_x86 will be updated in-place
  ~ resource "aws_launch_template" "worker_internal_x86" {
      ~ default_version         = 4 -> (known after apply)
        id                      = "lt-0a23e96f3feb1649c"
      ~ latest_version          = 4 -> (known after apply)
        name                    = "imagebuilder_worker_internal_x86_staging"
        tags                    = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🔧 Internal Composer Worker (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ user_data               = "H4sIAAAAAAAA/9R52XLjtp73varyDvgcf5Wkeihx0WL5xKkjSqRWUhJXUWemXCAIiRTBxSSordMvMjdzO483jzBFLW7Z3VknN/FNi8B/xw//Bd1NYopjyhiHFD+CqCA0SGFGa1Gwx94/gJsUsQezw9OdMlQkcWqqvY7m3FXKL8bCWR4k8SPgquw3lW8qDHNL9E3lKrsX5GmSB/RECymFyI9wTP8BVgHBMYzw010QB7SKVuu7z1xGBuN8hTNGilHiBfH6EbTcgN4QnEymeE9riCSFx6AkXgXrbypKEOEvjPv2lqZSKXKc5Y8VABhQWvAIMOKZcrECAAB57j/DgvpJFhyx9xziw4m2/GPAXZ77TJZD0Ol0OqKgHmGXOyBeKj97nXlH7HQ63c68u9+s5OGQ9FfduB0gMjhEdiaJmWHyZNKkod43OJy2vO7suOM2TtOO/TmZLZQUz7JA3asL0n9A9rRd0+RU9NhjW96phw/hau23V8VBdert4QcFNqcHwxLXDV9N5P1KW/QbwYCimj4nsSvJwTjVwzoJ0qQ+X1KRRuvOyzrUO83e0T+s3WbRUNrB3hju67a4KXSF7S/mR3WT4tUhsIsP+VD74PNmNg/HHbEohs7czTbkg+xbEZxss+3BmPJFPqXb2BE3vjvbHaYt3p5tYDr2am3fgC8zidvJh6Yp8/EC1WfrHbsO5m4zD1zZOLZUA+9toTFvP7yk86mtOGOUrpcZ0eFgMF7qik+P05biLbPpRDYXic51cOdQX/sUqdlUNIjb0LezlnA8si+iJvOoO61P2V3a2O1eZv52x8fUFVJjMqMepqMPVoOdz+I0Xhx0PV6m/FHeIcxz7mLfbMV+m8T+JFuuN7iFknk868j7GiJCU9JHh3VQzJC4+xByD05BHGVhvkCRhrvRJNQ2vXRjLHjcUEZcM+m18tEA1Wt2IzysJltPyS3fe+G6i0HfsqbpMVm7bLthOQGrLeQ0Xmo1Dlvrbk37YFsH6qycBzZbWVPkdRK+v1zFo8bR0czFaNRWliGM93tBapnTIJRGajs3NzzLHpvdw4EdroYvhjvixMaqtfIEiLRsUu8hx/TkYY0TD6rdlLlNCy2DTn86GqvucSGzhkBXD3sWc/OnJxDBTZL9M8OeD2kVJdHdW7xjj280uPYJ890z5smyN+RUQ2qUa8OZyG1kUk+bsiEG+4HR3E3D5uIh3tSWLZzM1LlUU9jduP7QGIPELTwYvFFW2WUBxc9lRrhcyxRS/xHUaJSer/dzmSOetzDLT5ahcxZ4BD9fDJ3qojmc9J67U0UZGk8PAoKrB5bFDb7B1906V1+1Vg131YCY9QTU5nj00Oba/IW7O1VmU13SruytVQMLTc9r1x+4BruCqO6yQlNooqYntF231cQ8fuC81XvlneeupBlPE52lE53raqY3MgKxp1kjUzeXozkrm9ppj6XdkBvppiZZktqb28vFkpUF3RyJS5ZYZk+dK7xzVC2xb4YNzuWXLI6UhtELea3vmy6viR6rabaZTlwuHcHBcmOEsqaZu/GcyKLHLl80y1LnIRnMDdnSTFnw2H2gsI10KXs54tKeulhuXFsV9L6/MULuZb7wZpZkNQ1LW2KTkyxDXcC+OjUWqejt0nKv/mYvlBeGNdI81optU7NNS5Y0SWa9SDnoG9m3BD8z+mwDW2lzzqqiyRJBk+WlHtKtHZLEi9Rp92TzqGuasrTkPdmUZOlEa7d75fc8lNV5LGa2JTu6pSrO0Z/YdqqaFolxLGpTUxUVbjRRIm+o9cS9s5CP3mY9dqzRxgoVXiVKYxn6e80099DcW7b0ICi9kYY31hHyaaII6d4YkIG58QWTONsJr44Ue7hHG9HCVmo47B4qHBIsKz3Mdwmr9rTIEZKjsSB1V1abFmctTU6M5yGZwL4nTgcyRSTVFbsdObZ2wANLN7r06IZLSbdpXRFQ5hzl8dKyCiVSc0X20i6xWLs3GmjcsqcRTzV4ebsMtcyWrZ4WWxN94I1N2+sbA+2oSyq0bTXyiGfrcgrVsF73WG+nEBnaxrDhHH3OXYgvitUZm9IytyWlvuzL0JA435ZJoBmiqi80W5HUoR6LgsaSnROTwrWI6XbpUYst3u1pW6vPHfAg2eKF30SSxlshN0OhPHLnad3lcwERi1oDK9T6lmxyo67Be6JiUs4xOd0aWL6+EDX3OApdYbkfHzt7LXKOc7N+sExV9FhLnNvy1JK4vrbwhqZFpC5Z6orU7s4JkbUwEZbG0lGEcLfst3Okt8cOWaZOSFKP1wqT62RqyHWnkicqlhXqC0+zTa7rmHJf33hEJesjNsTQ5XfjX+AVr7zawpPnQVswzaU6N7nu3HbqX79X+1eMztepqMUpr/KE6CxquHI6QeHwYNgchJK81yWiYHvvGwKxkYEE7Ui6hjUytVjd2bHJKoOhoHGa4LBa4kVrTjPVrS7LQTfaZ54hOqrZdpasxtsDtYv67b4+GPGKRGe6vTdUzhorC2en9vOtTkhsD1Dm9lPTGijb6SLduRtft6I9RQNzq7HczDDMsWmPBmaXTuHGguhoRRq7XECpLhjGkDNtak17o7E78Ikeyrm58Idzft8z+1bdDFXVMeSGuugIVr8RT3viRCceiy1xPp2nrMl76jzuCKpl6Uv7gVVNs25K6UGPO0c4IFtVHtWn1kjTeHrAtqrrCy+ahz4PBV/Vo2WBeEWw9Tav2oTTNj7FEtfsblTWCZPGmE0bmilz+iDZO6HHIVN1xoI8Ni3N9LptzT06By/0Fo4ZNkxuOXGIUncsX5kfR1M1ljfQHu3RxqwvN5qkh/OxHqu5oT8IaKA20EbeqguNdcJRoZKQmy+Udjc452TNbEhDSZVNoo20kPTmliafczk7fl8pBlPdeIK7vCxgaZLjrJrkbhEQr5pk6/fEnV5Pk3T9iWOrAlvlHqocdyGxp9pY0p51ffI8lhz9uaOpTzCLH+Euf8wxyjDNIxjDNc4ei5zBMKcM99gWhFaD59qtdrt9oXp0M7w7tapMSzYxJhf5uinqXW04M4ZT9VnpqJ3+pcp11N6fV5YXbo6yIC2beubCwqAkimDsMeHcIUn7qt/RDUk5RUvtKNLzTJPk4eIpp3AdxGsmiCnOYkiYXZKFl/b7Jm69ofZUwxTVLrFlrsG+Spe6mmTor45Jam82HarGs6lNnnxK0/yxVtumCDOsxwlcoy6wzUa97XLIY9rHfdY6NrbVt55XXz2vloxVGMFjEl8Ounbbm3zNri8WqjSJyNdbln+FySb4j8sHJCTZYe/ZSyIYxDl4Av8CdxTD6BZWd/8G7vzCrZZn/X79HMAvt8BVA4LgCdx93WoEGZTRaorLXuxi3VngH7bvL7PjXaSjJA5ohr4eym+BUm6D83xXZLAEJlglGRhGcI2BWKrBGQhi0LH16itXL0H5I7gCJTrpOJ3z6VfNS1BRzqoncee1qk8jUnkV0PUxCgHe4uwABBbkGCWxlwMYe4Aka0ATkB9ykqyvKnNMgQdxlMRAYG/WSuIz5WfZnTLkACKE8xxsA1jOpYAWcYzJSTDGgPoYRFfP84TgWz2lWx5Ik4wC/oHjS6Muu+VfkWMAPS8rhZMEQeInOb3Zh2ftXhTEjycVnw2zcBasDoD6kIId/i7DIE4owJAG8brkO5uFoyQ7gCQ+fQVxTmGMXu3rDqTu+JIcwH2ZHV5VB6srb5GXZ/cTaDX+/41h5ak2ADoggvObZerjGOA9RqBW5Fnt5FLNDeJamhyTzE3oMyQ4u/FCivMiO4cwSxJ6eo7IDznFEQjy+DsKVgUhb+2VhxPpYvOJZdYxBqB2a3meQoRfDX9gvzScBtEbu3cB9YMYcH+FS2c0XrARrMAOAwRjkGGIfIC8uPp55vp8B9SpIX0f+fDg4fiHR2BjsAsIAZDs4CEHa0wBBHVWAD7OMHAxgiVykhVAJMAxBQhnNH8bpvI4QeZj8oy8GNhDYwAuBfCdEbeRW8GA4FuApkG8/hPB+FWR5V2o14XbpSyhCUrIOQncbOQU0qLMc3VWeHdcIM8JSE7FLwcfQbdTDn1DedjtGFIJkUvGyvw8qiFYO/vLFDgtExv49Keces2Fv+n8l8nx/51IXZj7r4eu49gDJ568xMtVTPVtPv0uBzjeBlkSl1kQbGEWQJfgHMAMg2tyxN4JGo+vrH84nX4rqdZQm6qKpBpXMM9NyZTelPGXAhfvy/Ftb1ILylTPuOdUz1xdYi6txkWuIul6py893f3Pf/3nf4N7ZaoOjedyCDdO9/OyoEuaNexKZfa6rJwwDen1s9cxpOsbiSbp5sR4uv8e7nKQv+Qgx7HHRDg/ZQGGORnOFBkB969eAeZKwLiJdwB39xfD7n64SMXIT8D9WXalkhUxirzz0wjyo8QDH/a/AzNnUrbFsu+LKAPOuQ5RAnBcnipgmDjZncvJrzzn/pGH2T2T+5iQc6v4Sy+zN+gsqxaDiwSkQYrL21vJkyJD+OvvQJVvQR/TN+UFDHvVylDVjY7alZ6Hvaf771EZeGaSn2D5WKtxzXaVb9Srl39rBFKc01qEKWQ8SGHtKosJvB9KHZ08x1EZn7JAxjDC1YpsTiavLe3T3f3Hr3e5n5j7jzfGfLorxc2yIKYgKc6Gx3h3I/d05nc6pqdKeilG1+3ynt5/fKP6U/UkUr9E4R1DtXL9VR5yjinzKur+jZi/x2lfgnOePNwyQK+nThOgDdRzMDS8DnKKs7e4OKXtkqby7tKc7uybAaAsecx5idlCUmDw7+V9uS4FHrj/+FtT1SfwM9i8ACYDd1X9xKfTLIjXd+Cns3e3A9TzRfHzZYCqbvIkrlzZf43y7ncKAz+DU8SzCDCr32tA5WtD3uU/cADDwIImfyfg9HBKkgMoJ+RTpj/PKfkZNJfNEjLXWQR0O6feJlgFCFJcrbgwx806YDzAgB9//BHcf3z37PsJ/ATuP97Orp9uBppfUhPiw2lceKPrLwHpV54WfhOX56ic3hHewvDzxt3XKc8Ye43Ql6E4MzAhPpzC8U4wyuj/UfA1zjcg/8Kbvx9eT2W7zNtfQW2Z94v0hqTyLTCmvenbbj7G2CszJEriLc7KShGcer6eqoOy+GVgV3ahOwwILGLkVysI0hPC724ifWngP91Gv6wfn+7ATz/dmvA3CvG10BbpJa4gx9k2QPgS31mG07LTff9M8V0OMhwlFL9nO13kPEEhLkeiX2iwrtLOIi4PX/98H9bHhxbLfhFMhvmm8r8BAAD//5B24/20HwAA" -> (known after apply)
        # (8 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_spot_fleet_request.workers_external_x86 must be replaced
-/+ resource "aws_spot_fleet_request" "workers_external_x86" {
      ~ client_token                        = "terraform-20210127183532909300000002" -> (known after apply)
      ~ id                                  = "sfr-a1ec36af-90a8-4b54-8713-aea7afa9b80e" -> (known after apply)
      ~ load_balancers                      = [] -> (known after apply)
      ~ spot_request_state                  = "active" -> (known after apply)
        tags                                = {
            "AppCode"      = "IMGB-001"
            "Name"         = "External worker fleet - staging"
            "ServiceOwner" = "Image Builder"
        }
      ~ target_group_arns                   = [] -> (known after apply)
        # (10 unchanged attributes hidden)

      - launch_template_config { # forces replacement
          - launch_template_specification {
              - id      = "lt-0195b4ef20679c780" -> null
              - version = "4" -> null
            }

          - overrides {
              - instance_type     = "c5.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
        }
      + launch_template_config { # forces replacement
          + launch_template_specification {
              + id      = "lt-0195b4ef20679c780"
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
        }
    }

  # aws_spot_fleet_request.workers_internal_x86 must be replaced
-/+ resource "aws_spot_fleet_request" "workers_internal_x86" {
      ~ client_token                        = "terraform-20210127183602415500000004" -> (known after apply)
      ~ id                                  = "sfr-b4db8c56-4723-42e2-ac26-e56ce7040189" -> (known after apply)
      ~ load_balancers                      = [] -> (known after apply)
      ~ spot_request_state                  = "active" -> (known after apply)
        tags                                = {
            "AppCode"      = "IMGB-001"
            "Name"         = "Image Builder internal worker fleet - staging"
            "ServiceOwner" = "Image Builder"
        }
      ~ target_group_arns                   = [] -> (known after apply)
        # (10 unchanged attributes hidden)

      - launch_template_config { # forces replacement
          - launch_template_specification {
              - id      = "lt-0a23e96f3feb1649c" -> null
              - version = "4" -> null
            }

          - overrides {
              - instance_type     = "c5.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
        }
      + launch_template_config { # forces replacement
          + launch_template_specification {
              + id      = "lt-0a23e96f3feb1649c"
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
        }
    }

  # aws_volume_attachment.composer_external must be replaced
-/+ resource "aws_volume_attachment" "composer_external" {
      ~ id          = "vai-3854467784" -> (known after apply)
      ~ instance_id = "i-0c064f46bdf5514bc" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_volume_attachment.composer_internal must be replaced
-/+ resource "aws_volume_attachment" "composer_internal" {
      ~ id          = "vai-245504478" -> (known after apply)
      ~ instance_id = "i-09a84de392bf97ace" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 6 to add, 2 to change, 6 to destroy.
```

</details>

*Pusher: @ondrejbudai, Action: `pull_request`*